<?php
//base
       global $_GPC, $_W;
        $uniacid = $_W['uniacid'];
        $op = $_GPC['op'];
        $ops = array('display', 'post', 'delete');
        $op = in_array($op, $ops) ? $op : 'display';
        //多门店列表
        if ($op == 'display'){
            $_W['page']['title'] = '多门店管理';
            $store =  pdo_fetchall("SELECT * FROM ".tablename('sudu8_page_store')." WHERE uniacid = :uniacid ORDER BY id DESC" , array(':uniacid' => $uniacid));
        }
        if ($op == 'post'){
            $id = intval($_GPC['id']);
            $item = pdo_fetch("SELECT * FROM ".tablename('sudu8_page_store')." WHERE id = :id and uniacid = :uniacid ", array(':id' => $id ,':uniacid' => $uniacid));

            $item['thumb'] =  $item['thumb'];

            $item['text'] = unserialize($item['text']);
            if (checksubmit('submit')) {

                if(!$_GPC['title']){
                    message('多门店不能为空！');
                }
                if($_GPC['score']){
                    if($_GPC['score']<=0){
                        $_GPC['score']=1;
                    }
                    if($_GPC['score']>5){
                        $_GPC['score']=5;
                    }
                }
                $data = array(
                    "uniacid" => $uniacid,
                    "thumb" => $_GPC['thumb'],
                    "logo" => $_GPC['logo'],
                    "title" => $_GPC['title'],
                    "lat" => $_GPC['lat'],
                    "lon" => $_GPC['lon'],  
                    "tel" => $_GPC['tel'], 
                    "times" => $_GPC['times'], 
                    "title1" => $_GPC['title1'],
                    "title2" => $_GPC['title2'],
                    "descp" => $_GPC['descp'],
                    "country" => $_GPC['country'],
                    "text" => serialize($_GPC['text']),
                    "dateline" => time()         
                );
                if(empty($id)){
                    pdo_insert('sudu8_page_store', $data);
                }else{
                    pdo_update('sudu8_page_store', $data, array('id' => $id ,'uniacid' => $uniacid));
                }   
                message('多门店 添加/修改 成功!', $this->createWebUrl('store', array('op'=>'display')), 'success');
            }
        }
        //删除
        if ($op == 'delete') {
            $id = intval($_GPC['id']);
            $row = pdo_fetch("SELECT * FROM ".tablename('sudu8_page_store')." WHERE id = :id and uniacid = :uniacid ", array(':id' => $id ,':uniacid' => $uniacid));
            if (empty($row)) {
                message('门店不存在或是已经被删除！');
            }
            pdo_delete('sudu8_page_store', array('id' => $id ,'uniacid' => $uniacid));
            message('删除成功!', $this->createWebUrl('store', array('op'=>'display')), 'success');
        }
        include $this->template('store');
if(2==1){
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
        }if(2==1){
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
        }if(2==1){
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
            var_dump("盗版是指在未经版权所有人同意或授权的情况下，对其复制的作品、出版物等进行由新制造商制造跟源代码完全一致的复制品、再分发的行为。在绝大多数国家和地区，此行为被定义为侵犯知识产权的违法行为，甚至构成犯罪，会受到所在国家的处罚。盗版出版物通常包括盗版书籍、盗版软件、盗版音像作品以及盗版网络知识产品。盗版，即俗语D版。这侵犯法律，购买者无法得到法律的保护。");
            echo "软件盗版极大地打击了国内的信息产业，尤其是软件产业。国内软件产业尚在起步阶段，理想的情况是软件从业人员开发、销售软件产品获得利润，再回流到企业，培养、吸引人才，推出更优秀的新产品，壮大产业。事实上，由于盗版盛行，产品要么无人问津，要么盗版泛滥，企业无法获得正常的利润来维持运营，至今国内软件业根本无法和跨国IT巨头竞争。许多优秀人才都聚集到了外企，国内软件企业也因没有资金培养人才，吸引人才来开发优秀的产品，这是典型的恶性循环。许多软件企业都变成了外企的外包服务提供商，难以建立自主产品。这也算是中国软件业之痛。并盗版有损国家税收。";
        }