<?php

return array(
    'mode' => array(
        "0" => '不限',
        "1" => '整租',
        "2" => '合租',
        "3" => '民宿',
    ),
    'price' => array(
        "0" => '不限',
        "1" => '1500以下',
        "2" => '1500-2000元',
        "3" => '2000-2500元',
        "4" => '2500-3000元',
        "5" => '3000以上',
    ),
    "rec" => array(
        "0" => '推荐排序',
        "1" => '最新发布',
        "2" => '价格升序',
        "3" => '价格降序',
        "4" => '面积升序',
        "5" => '面积降序',
    ),
    'sort' => array(
        //装修状态
        'renovation' => array(
            "1" => '精装',
            "2" => '简装',
            "3" => '毛坯',
        ),
        //朝向
        'oriented' => array(
            "0" => '东',
            "1" => '南',
            "2" => '西',
            "3" => '北',
            "4" => '南北',
            "5" => '东西',
            "6" => '东南',
            "7" => '东北',
            "8" => '西南',
            "9" => '西北',
        ),
        //楼层
        'layer' => array(
            "0" => '低楼层',
            "1" => '中楼层',
            "2" => '高楼层',
        )
    ),

);