<?php

$config = array(
    //出租类型
    'type' => array(
        "1" => '整租',
        "2" => '合租',
        "3" => '民宿',
    ),
    //装修状态
    'renovation' => array(
        "0" => '精装',
        "1" => '简装',
        "2" => '毛坯',
    ),
    //朝向
    'oriented' => array(
        "0" => '东',
        "1" => '南',
        "2" => '西',
        "3" => '北',
        "4" => '南北',
        "5" => '东西',
        "6" => '东南',
        "7" => '东北',
        "8" => '西南',
        "9" => '西北',
    ),
);

return $config;


