<?php
// +----------------------------------------------------------------------
// | msvodx[TP5内核]
// +----------------------------------------------------------------------
// | Copyright © 2019-QQ97250974
// +----------------------------------------------------------------------
// | 专业二开仿站定制修改,做最专业的视频点播系统
// +----------------------------------------------------------------------
// | Author: cherish ©2018
// +----------------------------------------------------------------------
namespace app\admin\validate;

use think\Validate;

/**
 * 钩子验证器
 * @package app\admin\validate
 */
class Gift extends Validate
{
    //定义验证规则
    protected $rule = [
        'name|礼物名称' => 'require',
        'images|礼物图标' => 'require',
        'price|礼物价格' => 'require',
    ];
    //定义验证提示
    protected $message = [

    ];

    //定义验证场景
    protected $scene = [
        //更新


    ];

}
