<?php
// +----------------------------------------------------------------------
// | msvodx[TP5内核]
// +----------------------------------------------------------------------
// | Copyright © 2019-QQ97250974
// +----------------------------------------------------------------------
// | 专业二开仿站定制修改,做最专业的视频点播系统
// +----------------------------------------------------------------------
// | Author: cherish ©2018
// +----------------------------------------------------------------------
namespace app\common\model;

use think\Model;
/**
 * 附件分组模型
 * @package app\common\model
 */
class AdminAnnexGroup extends Model
{
    // 自动写入时间戳
    protected $autoWriteTimestamp = false;

}
