define(function() {
			function t(t, i, e) {
				if(!t.district) return !1;
				t.district.options.length = 0, e.withTitle && t.district.options.add(new Option("鍖 /铡 ", ""));
				var c = t.province.options[t.province.options.selectedIndex],
					l = $(c).attr("pid"),
					c = t.city.options[t.city.options.selectedIndex],
					r = $(c).attr("cid");
				l && r && ($(t.district).show(), $.each(s[l].cities[r].districts, function(i, s) {
					var e = new Option(s, s);
					t.district.options.add(e)
				})), i.district && $(t.district).val(i.district)
			}

			function i(i, e, c) {
				if(!i.city) return !1;
				i.city.options.length = 0, c.withTitle && i.city.options.add(new Option("宁  ", ""));
				var l = i.province.options[i.province.options.selectedIndex],
					r = $(l).attr("pid");
				r && $.each(s[r].cities, function(t, s) {
					if("鍖椾含宁 " != s.title && "涓婃捣宁 " != s.title && "澶╂触宁 " != s.title && "阅嶅简宁 " != s.title || !c.wechat) {
						if(c.wechat) {
							var e = s.title.indexOf("宁 ");
							e > -1 && (s.title = s.title.substr(0, e))
						}
						var l = new Option(s.title, s.title);
						$(l).attr("cid", t), i.city.options.add(l)
					} else $.each(s.districts, function(t, e) {
						var c = e.indexOf("鍖 ");
						c > -1 && (e = e.substr(0, c)), (c = e.indexOf("铡 ")) > -1 && "钃熷幕" != e && "蹇犲幕" != e && "寮€铡 " != e && (e = e.substr(0, c)), "阅嶅简宁 " == s.title && e.length > 3 && (e = e.substr(0, 2));
						var l = new Option(e, e);
						$(l).attr("cid", t), i.city.options.add(l)
					})
				}), e.city && $(i.city).val(e.city), i.district && ($(i.city).on("change", function() {
					t(i, e, c)
				}), $(i.city).trigger("change"))
			}
			var s = {
					110000: {
						title: "鍖椾含",
						cities: {
							110100: {
								title: "鍖椾含宁 ",
								districts: {
									110101: "涓滃煄鍖 ",
									110102: "瑗垮煄鍖 ",
									110103: "宕囨枃鍖 ",
									110104: "瀹ｆ鍖 ",
									110105: "链濋槼鍖 ",
									110106: "涓板彴鍖 ",
									110107: "鐭虫櫙灞卞尯",
									110108: "娴锋稳鍖 ",
									110109: "闂ㄥご娌熷尯",
									110111: "鎴垮北鍖 ",
									110112: "阃氩窞鍖 ",
									110113: "椤轰箟鍖 ",
									110114: "鏄屽钩鍖 ",
									110115: "澶у叴鍖 ",
									110116: "镐€镆斿尯",
									110117: "骞宠胺鍖 ",
									110228: "瀵嗕簯铡 ",
									110229: "寤跺简铡 ",
									110230: "鍏跺畠鍖 "
								}
							}
						}
					},
					120000: {
						title: "澶╂触",
						cities: {
							120100: {
								title: "澶╂触宁 ",
								districts: {
									120101: "鍜屽钩鍖 ",
									120102: "娌充笢鍖 ",
									120103: "娌宠タ鍖 ",
									120104: "鍗楀紑鍖  ",
									120105: "娌冲宝鍖 ",
									120106: "绾㈡ˉ鍖 ",
									120107: "濉樻步鍖 ",
									120108: "姹夋步鍖 ",
									120109: "澶ф腐鍖 ",
									120110: "涓滀附鍖 ",
									120111: "瑗块潚鍖 ",
									120112: "娲ュ崡鍖 ",
									120113: "鍖楄景鍖 ",
									120114: "姝︽竻鍖 ",
									120115: "瀹濆澔鍖 ",
									120116: "婊ㄦ捣鏂板尯",
									120221: "瀹佹渤铡 ",
									120223: "闱欐捣铡 ",
									120225: "钃熷幕",
									120226: "鍏跺畠鍖 "
								}
							}
						}
					},
					130000: {
						title: "娌冲宝鐪 ",
						cities: {
							130100: {
								title: "鐭冲搴勫竞",
								districts: {
									130102: "闀垮畨鍖 ",
									130103: "妗ヤ笢鍖 ",
									130104: "妗ヨタ鍖 ",
									130105: "鏂板崕鍖 ",
									130107: "浜曢槟鐭垮尯",
									130108: "瑁曞崕鍖 ",
									130121: "浜曢槟铡 ",
									130123: "姝ｅ畾铡 ",
									130124: "镙惧煄铡 ",
									130125: "琛屽攼铡 ",
									130126: "鐏靛铡 ",
									130127: "楂橀倯铡 ",
									130128: "娣辨辰铡 ",
									130129: "璧炵殗铡 ",
									130130: "镞犳瀬铡 ",
									130131: "骞冲北铡 ",
									130132: "鍏冩皬铡 ",
									130133: "璧靛幕",
									130181: "杈涢泦宁 ",
									130182: "钘佸煄宁 ",
									130183: "鏅嫔窞宁 ",
									130184: "鏂颁箰宁 ",
									130185: "楣挎硥宁 ",
									130186: "鍏跺畠鍖 "
								}
							},
							130200: {
								title: "鍞愬北宁 ",
								districts: {
									130202: "璺崡鍖 ",
									130203: "璺宝鍖 ",
									130204: "鍙ゅ喍鍖 ",
									130205: "寮€骞冲尯",
									130207: "涓板崡鍖 ",
									130208: "涓版鼎鍖 ",
									130223: "婊﹀幕",
									130224: "婊﹀崡铡 ",
									130225: "涔愪涵铡 ",
									130227: "杩佽タ铡 ",
									130229: "鐜夌敯铡 ",
									130230: "鍞愭捣铡 ",
									130281: "阆靛寲宁 ",
									130283: "杩佸畨宁 ",
									130284: "鍏跺畠鍖 "
								}
							},
							130300: {
								title: "绉︾殗宀涘竞",
								districts: {
									130302: "娴锋腐鍖 ",
									130303: "灞辨捣鍏冲尯",
									130304: "鍖楁埓娌冲尯",
									130321: "闱掗緳婊℃棌镊不铡 ",
									130322: "鏄岄粠铡 ",
									130323: "鎶氩畞铡  ",
									130324: "鍗㈤緳铡 ",
									130398: "鍏跺畠鍖 ",
									130399: "缁忔祹鎶€链紑鍙戝尯"
								}
							},
							130400: {
								title: "闾兏宁 ",
								districts: {
									130402: "闾北鍖 ",
									130403: "涓涘彴鍖 ",
									130404: "澶嶅叴鍖 ",
									130406: "宄板嘲鐭垮尯",
									130421: "闾兏铡 ",
									130423: "涓存汲铡 ",
									130424: "鎴愬畨铡 ",
									130425: "澶у悕铡 ",
									130426: "娑夊幕",
									130427: "纾佸幕",
									130428: "镶ヤ埂铡 ",
									130429: "姘稿勾铡 ",
									130430: "闾卞幕",
									130431: "楦℃辰铡 ",
									130432: "骞垮钩铡 ",
									130433: "棣嗛櫠铡 ",
									130434: "榄忓幕",
									130435: "旋插懆铡 ",
									130481: "姝﹀畨宁 ",
									130482: "鍏跺畠鍖  "
								}
							},
							130500: {
								title: "闾㈠彴宁 ",
								districts: {
									130502: "妗ヤ笢鍖 ",
									130503: "妗ヨタ鍖 ",
									130521: "闾㈠彴铡 ",
									130522: "涓村煄铡 ",
									130523: "鍐呬笜铡 ",
									130524: "镆忎埂铡 ",
									130525: "闅嗗哀铡 ",
									130526: "浠诲幕",
									130527: "鍗楀拰铡 ",
									130528: "瀹佹檵铡 ",
									130529: "宸ㄩ箍铡 ",
									130530: "鏂版渤铡 ",
									130531: "骞垮畻铡 ",
									130532: "骞充埂铡 ",
									130533: "濞佸幕",
									130534: "娓呮渤铡 ",
									130535: "涓磋タ铡 ",
									130581: "鍗楀宁 ",
									130582: "娌欐渤宁 ",
									130583: "鍏跺畠鍖 "
								}
							},
							130600: {
								title: "淇濆畾宁 ",
								districts: {
									130602: "鏂板竞鍖 ",
									130603: "鍖楀竞鍖 ",
									130604: "鍗楀竞鍖 ",
									130621: "婊″煄铡 ",
									130622: "娓呰嫅铡 ",
									130623: "娑炴按铡 ",
									130624: "阒滃钩铡 ",
									130625: "寰愭按铡 ",
									130626: "瀹氩叴铡 ",
									130627: "鍞愬幕",
									130628: "楂橀槼铡 ",
									130629: "瀹瑰煄铡 ",
									130630: "娑炴簮铡 ",
									130631: "链涢兘铡 ",
									130632: "瀹夋柊铡 ",
									130633: "鏄揿幕",
									130634: "旋查槼铡 ",
									130635: "锠″幕",
									130636: "椤哄钩铡 ",
									130637: "鍗氶当铡 ",
									130638: "板勫幕",
									130681: "娑垮窞宁 ",
									130682: "瀹氩窞宁 ",
									130683: "瀹夊浗宁 ",
									130684: "楂樼搴楀竞",
									130698: "楂桦紑鍖 ",
									130699: "鍏跺畠鍖 "
								}
							},
							130700: {
								title: "寮犲鍙ｅ竞",
								districts: {
									130702: "妗ヤ笢鍖 ",
									130703: "妗ヨタ鍖 ",
									130705: "瀹ｅ寲鍖 ",
									130706: "涓嬭姳锲尯",
									130721: "瀹ｅ寲铡 ",
									130722: "寮犲宝铡 ",
									130723: "搴蜂缭铡 ",
									130724: "娌芥簮铡 ",
									130725: "灏氢箟铡 ",
									130726: "钄氩幕",
									130727: "阒冲师铡 ",
									130728: "镐€瀹夊幕",
									130729: "涓囧叏铡 ",
									130730: "镐€鏉ュ幕",
									130731: "娑块箍铡 ",
									130732: "璧ゅ煄铡 ",
									130733: "宕囩ぜ铡 ",
									130734: "鍏跺畠鍖 ",
									130707: "楂樻柊鍖 "
								}
							},
							130800: {
								title: "镓垮痉宁 ",
								districts: {
									130802: "鍙屾ˉ鍖 ",
									130803: "鍙屾沪鍖 ",
									130804: "楣版坠钀ュ瓙鐭垮尯",
									130821: "镓垮痉铡 ",
									130822: "鍏撮殕铡 ",
									130823: "骞虫硥铡 ",
									130824: "婊﹀钩铡 ",
									130825: "闅嗗寲铡 ",
									130826: "涓板畞婊℃棌镊不铡 ",
									130827: "瀹借煄婊℃棌镊不铡 ",
									130828: "锲村満婊℃棌钂椤彝镞忚嚜娌诲幕",
									130829: "鍏跺畠鍖 "
								}
							},
							130900: {
								title: "娌у窞宁 ",
								districts: {
									130902: "鏂板崕鍖 ",
									130903: "杩愭渤鍖 ",
									130921: "娌у幕",
									130922: "闱掑幕",
									130923: "涓滃厜铡 ",
									130924: "娴峰叴铡 ",
									130925: "鐩愬北铡 ",
									130926: "镶冨畞铡 ",
									130927: "鍗楃毊铡 ",
									130928: "钖存ˉ铡 ",
									130929: "鐚幕",
									130930: "瀛熸沩锲炴棌镊不铡 ",
									130981: "娉婂ご宁 ",
									130982: "浠讳笜宁  ",
									130983: "榛勯貘宁 ",
									130984: "娌抽棿宁 ",
									130985: "鍏跺畠鍖 "
								}
							},
							131000: {
								title: "寤婂泼宁 ",
								districts: {
									131002: "瀹夋鍖 ",
									131003: "骞块槼鍖 ",
									131022: "锲哄畨铡 ",
									131023: "姘告竻铡 ",
									131024: "棣欐渤铡 ",
									131025: "澶у煄铡 ",
									131026: "鏂囧畨铡 ",
									131028: "澶у巶锲炴棌镊不铡 ",
									131051: "寮€鍙戝尯",
									131052: "鐕曢侪缁忔祹鎶€链紑鍙戝尯",
									131081: "暗稿窞宁 ",
									131082: "涓夋渤宁 ",
									131083: "鍏跺畠鍖 "
								}
							},
							131100: {
								title: "琛℃按宁 ",
								districts: {
									131102: "妗冨煄鍖 ",
									131121: "鏋ｅ己铡 ",
									131122: "姝﹂倯铡 ",
									131123: "姝﹀己铡 ",
									131124: "楗堕槼铡 ",
									131125: "瀹夊钩铡 ",
									131126: "鏁呭煄铡 ",
									131127: "鏅幕",
									131128: "阒滃煄铡  ",
									131181: "鍐€宸炲竞",
									131182: "娣卞窞宁 ",
									131183: "鍏跺畠鍖 "
								}
							}
						}
					},
					140000: {
						title: "灞辫タ鐪 ",
						cities: {
							140100: {
								title: "澶师宁 ",
								districts: {
									140105: "灏忓簵鍖 ",
									140106: "杩庢辰鍖 ",
									140107: "鏉忚姳宀尯",
									140108: "灏栬崏鍧尯",
									140109: "涓囨煆鏋楀尯",
									140110: "鏅嬫簮鍖 ",
									140121: "娓呭緪铡 ",
									140122: "阒虫洸铡 ",
									140123: "濞勭储铡 ",
									140181: "鍙や氦宁 ",
									140182: "鍏跺畠鍖 "
								}
							},
							140200: {
								title: "澶у悓宁 ",
								districts: {
									140202: "鍩庡尯",
									140203: "鐭垮尯",
									140211: "鍗楅侪鍖 ",
									140212: "鏂拌崳鍖 ",
									140221: "阒抽珮铡 ",
									140222: "澶╅晣铡 ",
									140223: "骞跨伒铡 ",
									140224: "鐏典笜铡 ",
									140225: "娴戞簮铡 ",
									140226: "宸︿簯铡 ",
									140227: "澶у悓铡 ",
									140228: "鍏跺畠鍖 "
								}
							},
							140300: {
								title: "阒虫硥宁 ",
								districts: {
									140302: "鍩庡尯",
									140303: "鐭垮尯",
									140311: "閮婂尯",
									140321: "骞冲畾铡 ",
									140322: "鐩效幕",
									140323: "鍏跺畠鍖 "
								}
							},
							140400: {
								title: "闀挎不宁 ",
								districts: {
									140421: "闀挎不铡 ",
									140423: "瑗勫灒铡 ",
									140424: "灞暀铡 ",
									140425: "骞抽『铡 ",
									140426: "榛庡煄铡  ",
									140427: "澹跺叧铡 ",
									140428: "闀垮瓙铡 ",
									140429: "姝︿埂铡 ",
									140430: "娌佸幕",
									140431: "娌佹簮铡 ",
									140481: "娼炲煄宁 ",
									140482: "鍩庡尯",
									140483: "閮婂尯",
									140484: "楂樻柊鍖 ",
									140485: "鍏跺畠鍖 "
								}
							},
							140500: {
								title: "鏅嫔煄宁 ",
								districts: {
									140502: "鍩庡尯",
									140521: "娌佹按铡  ",
									140522: "阒冲煄铡 ",
									140524: "闄靛窛铡 ",
									140525: "娉借窞铡 ",
									140581: "楂桦钩宁 ",
									140582: "鍏跺畠鍖  "
								}
							},
							140600: {
								title: "链斿窞宁 ",
								districts: {
									140602: "链斿煄鍖 ",
									140603: "骞抽瞾鍖 ",
									140621: "灞遍槾铡 ",
									140622: "搴斿幕",
									140623: "鍙崇帀铡 ",
									140624: "镐€浠佸幕",
									140625: "鍏跺畠鍖 "
								}
							},
							140700: {
								title: "鏅嬩腑宁 ",
								districts: {
									140702: "姒嗘鍖 ",
									140721: "姒嗙ぞ铡 ",
									140722: "宸︽潈铡 ",
									140723: "鍜岄『铡 ",
									140724: "鏄旈槼铡 ",
									140725: "瀵块槼铡 ",
									140726: "澶胺铡 ",
									140727: "绁佸幕",
									140728: "骞抽仴铡 ",
									140729: "鐏电煶铡 ",
									140781: "浠嬩紤宁 ",
									140782: "鍏跺畠鍖 "
								}
							},
							140800: {
								title: "杩愬煄宁 ",
								districts: {
									140802: "鐩愭箹鍖 ",
									140821: "涓寸宝铡 ",
									140822: "涓囱崳铡 ",
									140823: "闂诲枩铡 ",
									140824: "绋峰北铡 ",
									140825: "鏂扮粤铡 ",
									140826: "缁涘幕",
									140827: "鍨ｆ洸铡 ",
									140828: "澶忓幕",
									140829: "骞抽檰铡 ",
									140830: "鑺煄铡 ",
									140881: "姘告祹宁 ",
									140882: "娌虫触宁 ",
									140883: "鍏跺畠鍖 "
								}
							},
							140900: {
								title: "蹇诲窞宁  ",
								districts: {
									140902: "蹇诲簻鍖 ",
									140921: "瀹氲铡 ",
									140922: "浜斿彴铡 ",
									140923: "浠ｅ幕",
									140924: "绻佸硻铡  ",
									140925: "瀹佹铡 ",
									140926: "闱欎箰铡 ",
									140927: "绁炴睁铡 ",
									140928: "浜斿铡 ",
									140929: "宀㈠瞩铡  ",
									140930: "娌虫洸铡 ",
									140931: "淇濆痉铡 ",
									140932: "锅忓叧铡 ",
									140981: "铡熷钩宁 ",
									140982: "鍏跺畠鍖  "
								}
							},
							141000: {
								title: "涓存本宁 ",
								districts: {
									141002: "灏ч兘鍖 ",
									141021: "旋叉矁铡 ",
									141022: "缈煎煄铡 ",
									141023: "瑗勬本铡 ",
									141024: "娲礊铡 ",
									141025: "鍙ゅ幕",
									141026: "瀹夋辰铡 ",
									141027: "娴北铡 ",
									141028: "钖夊幕",
									141029: "涔″畞铡 ",
									141030: "澶у畞铡 ",
									141031: "闅板幕",
									141032: "姘稿拰铡 ",
									141033: "钂插幕",
									141034: "姹捐タ铡 ",
									141081: "渚┈宁 ",
									141082: "暗嶅窞宁 ",
									141083: "鍏跺畠鍖  "
								}
							},
							141100: {
								title: "钖曟宁 ",
								districts: {
									141102: "绂荤煶鍖 ",
									141121: "鏂囨按铡 ",
									141122: "浜ゅ煄铡 ",
									141123: "鍏村幕",
									141124: "涓村幕",
									141125: "镆虫滠铡 ",
									141126: "鐭虫ゼ铡 ",
									141127: "宀氩幕",
									141128: "鏂瑰北铡 ",
									141129: "涓槼铡 ",
									141130: "浜ゅ彛铡 ",
									141181: "瀛濅箟宁 ",
									141182: "姹鹃槼宁 ",
									141183: "鍏跺畠鍖 "
								}
							}
						}
					},
					150000: {
						title: "鍐呰挋鍙よ嚜娌诲尯",
						cities: {
							150100: {
								title: "锻煎拰娴╃壒宁 ",
								districts: {
									150102: "鏂板煄鍖 ",
									150103: "锲炴皯鍖 ",
									150104: "鐜夋硥鍖 ",
									150105: "璧涚綍鍖  ",
									150121: "鍦熼粯鐗瑰乏镞 ",
									150122: "镓桦厕镓桦幕",
									150123: "鍜屾滠镙煎皵铡 ",
									150124: "娓呮按娌冲幕",
									150125: "姝﹀窛铡 ",
									150126: "鍏跺畠鍖 "
								}
							},
							150200: {
								title: "鍖呭ご宁 ",
								districts: {
									150202: "涓沧渤鍖 ",
									150203: "鏄嗛兘浠戝尯",
									150204: "闱掑北鍖 ",
									150205: "鐭虫嫄鍖 ",
									150206: "锏戒簯鐭垮尯",
									150207: "涔濆师鍖 ",
									150221: "鍦熼粯鐗瑰彸镞 ",
									150222: "锲洪槼铡 ",
									150223: "杈惧皵缃曡寕鏄庡畨镵斿悎镞 ",
									150224: "鍏跺畠鍖  "
								}
							},
							150300: {
								title: "涔屾捣宁 ",
								districts: {
									150302: "娴峰媰婀惧尯",
									150303: "娴峰崡鍖 ",
									150304: "涔岃揪鍖  ",
									150305: "鍏跺畠鍖 "
								}
							},
							150400: {
								title: "璧ゅ嘲宁 ",
								districts: {
									150402: "绾㈠北鍖 ",
									150403: "鍏冨疂灞卞尯",
									150404: "鏉惧北鍖 ",
									150421: "阒块瞾绉戝皵娌佹枣",
									150422: "宸存滠宸︽枣",
									150423: "宸存滠鍙虫枣",
									150424: "鏋楄タ铡 ",
									150425: "鍏嬩粈鍏嬭吘镞 ",
									150426: "缈佺坛鐗规枣",
									150428: "锽€锽囨瞾镞 ",
									150429: "瀹佸煄铡 ",
									150430: "鏁栨眽镞  ",
									150431: "鍏朵粬鍖 ",
									150405: "妗ュ宝鏂板尯",
									150406: "鏂板煄鍖 "
								}
							},
							150500: {
								title: "阃氲窘宁 ",
								districts: {
									150502: "绉戝皵娌佸尯",
									150521: "绉戝皵娌佸乏缈间腑镞 ",
									150522: "绉戝皵娌佸乏缈煎悗镞 ",
									150523: "寮€椴佸幕",
									150524: "搴扑鸡镞 ",
									150525: "濂堟浖镞 ",
									150526: "镓庨瞾鐗规枣",
									150581: "暗嶆滠閮嫆宁 ",
									150582: "鍏跺畠鍖 "
								}
							},
							150600: {
								title: "閯效皵澶氭柉宁 ",
								districts: {
									150602: "涓滆儨鍖 ",
									150621: "杈炬媺鐗规枣",
									150622: "鍑嗘牸灏旀枣",
									150623: "閯傛墭鍏嫔墠镞 ",
									150624: "閯傛墭鍏嬫枣",
									150625: "鏉敠镞 ",
									150626: "涔屽镞 ",
									150627: "浼婇噾暗嶆礇镞 ",
									150628: "鍏跺畠鍖 "
								}
							},
							150700: {
								title: "锻间鸡璐濆皵宁 ",
								districts: {
									150702: "娴锋媺灏斿尯",
									150721: "阒胯崳镞  ",
									150722: "銮姏杈剧摝杈炬拐灏旀棌镊不镞 ",
									150723: "閯备鸡鏄ヨ嚜娌绘枣",
									150724: "閯傛俯鍏嬫棌镊不镞 ",
									150725: "闄埚反灏旇柠镞 ",
									150726: "鏂板反灏旇柠宸︽枣",
									150727: "鏂板反灏旇柠鍙虫枣",
									150781: "婊℃床阅屽竞",
									150782: "鐗椤厕鐭冲竞",
									150783: "镓庡叞灞竞",
									150784: "棰濆皵鍙ょ撼宁 ",
									150785: "镙规渤宁 ",
									150786: "鍏跺畠鍖 "
								}
							},
							150800: {
								title: "宸村溅娣栧皵宁 ",
								districts: {
									150802: "涓存渤鍖 ",
									150821: "浜斿师铡  ",
									150822: "纾村彛铡 ",
									150823: "涔屾媺鐗瑰墠镞 ",
									150824: "涔屾媺鐗逛腑镞 ",
									150825: "涔屾媺鐗瑰悗镞 ",
									150826: "鏉敠钖庢枣",
									150827: "鍏跺畠鍖 "
								}
							},
							150900: {
								title: "涔屽叞瀵熷竷宁 ",
								districts: {
									150902: "板嗗畞鍖  ",
									150921: "鍗撹祫铡 ",
									150922: "鍖栧痉铡 ",
									150923: "鍟嗛兘铡 ",
									150924: "鍏村拰铡 ",
									150925: "鍑夊煄铡 ",
									150926: "瀵熷搱灏斿彸缈煎墠镞 ",
									150927: "瀵熷搱灏斿彸缈间腑镞 ",
									150928: "瀵熷搱灏斿彸缈煎悗镞 ",
									150929: "锲涘瓙鐜嬫枣",
									150981: "涓伴晣宁 ",
									150982: "鍏跺畠鍖 "
								}
							},
							152200: {
								title: "鍏村畨鐩 ",
								districts: {
									152201: "涔屽叞娴╃壒宁 ",
									152202: "阒垮皵灞卞竞",
									152221: "绉戝皵娌佸彸缈煎墠镞 ",
									152222: "绉戝皵娌佸彸缈间腑镞 ",
									152223: "镓庤祲鐗规枣",
									152224: "绐佹硥铡 ",
									152225: "鍏跺畠鍖 "
								}
							},
							152500: {
								title: "阌℃滠閮嫆鐩 ",
								districts: {
									152501: "浜岃繛娴╃壒宁 ",
									152502: "阌℃滠娴╃壒宁 ",
									152522: "阒垮反鍢庢枣",
									152523: "鑻忓凹鐗瑰乏镞 ",
									152524: "鑻忓凹鐗瑰彸镞 ",
									152525: "涓滀箤鐝犵﹩娌佹枣",
									152526: "瑗夸箤鐝犵﹩娌佹枣",
									152527: "澶粏瀵烘枣",
									152528: "闀堕粍镞 ",
									152529: "姝ｉ暥锏芥枣",
									152530: "姝ｈ掴镞 ",
									152531: "澶氢鸡铡 ",
									152532: "鍏跺畠鍖 "
								}
							},
							152900: {
								title: "阒挎媺锽勭洘",
								districts: {
									152921: "阒挎媺锽勫乏镞 ",
									152922: "阒挎媺锽勫彸镞  ",
									152923: "棰濇祹绾虫枣",
									152924: "鍏跺畠鍖 "
								}
							}
						}
					},
					210000: {
						title: "杈借畞鐪 ",
						cities: {
							210100: {
								title: "娌堥槼宁 ",
								districts: {
									210102: "鍜屽钩鍖 ",
									210103: "娌堟渤鍖 ",
									210104: "澶т笢鍖 ",
									210105: "镄囧鍖 ",
									210106: "阈佽タ鍖 ",
									210111: "鑻忓灞尯",
									210112: "涓滈栎鍖 ",
									210113: "鏂板煄瀛愬尯",
									210114: "浜庢椽鍖 ",
									210122: "杈戒腑铡 ",
									210123: "搴峰钩铡 ",
									210124: "娉曞簱铡 ",
									210181: "鏂版皯宁 ",
									210182: "娴戝崡鏂板尯",
									210183: "寮犲＋寮€鍙戝尯",
									210184: "娌埚宝鏂板尯",
									210185: "鍏跺畠鍖 "
								}
							},
							210200: {
								title: "澶ц繛宁 ",
								districts: {
									210202: "涓北鍖 ",
									210203: "瑗垮矖鍖 ",
									210204: "娌欐渤鍙ｅ尯",
									210211: "鐢树簳瀛愬尯",
									210212: "镞呴『鍙ｅ尯",
									210213: "阅戝窞鍖 ",
									210224: "闀挎捣铡 ",
									210251: "寮€鍙戝尯",
									210281: "鐡︽埧搴楀竞",
									210282: "鏅叞搴楀竞",
									210283: "搴勬渤宁 ",
									210297: "宀墠鍖 ",
									210298: "鍏跺畠鍖 "
								}
							},
							210300: {
								title: "闉嶅北宁 ",
								districts: {
									210302: "阈佷笢鍖 ",
									210303: "阈佽タ鍖 ",
									210304: "绔嫔北鍖 ",
									210311: "鍗冨北鍖 ",
									210321: "鍙板畨铡 ",
									210323: "宀博婊℃棌镊不铡 ",
									210351: "楂樻柊鍖 ",
									210381: "娴峰煄宁 ",
									210382: "鍏跺畠鍖 "
								}
							},
							210400: {
								title: "鎶氶『宁 ",
								districts: {
									210402: "鏂版姎鍖 ",
									210403: "涓沧床鍖 ",
									210404: "链涜姳鍖 ",
									210411: "椤哄煄鍖 ",
									210421: "鎶氶『铡 ",
									210422: "鏂板婊℃棌镊不铡 ",
									210423: "娓呭师婊℃棌镊不铡 ",
									210424: "鍏跺畠鍖 "
								}
							},
							210500: {
								title: "链邯宁 ",
								districts: {
									210502: "骞冲北鍖 ",
									210503: "婧箹鍖 ",
									210504: "鏄庡北鍖 ",
									210505: "鍗楄姮鍖 ",
									210521: "链邯婊℃棌镊不铡 ",
									210522: "妗扑粊婊℃棌镊不铡 ",
									210523: "鍏跺畠鍖  "
								}
							},
							210600: {
								title: "涓逛笢宁 ",
								districts: {
									210602: "鍏冨疂鍖 ",
									210603: "鎸叴鍖 ",
									210604: "鎸畨鍖 ",
									210624: "瀹界敻婊℃棌镊不铡 ",
									210681: "涓沧腐宁 ",
									210682: "鍑ゅ煄宁 ",
									210683: "鍏跺畠鍖 "
								}
							},
							210700: {
								title: "阌﹀窞宁 ",
								districts: {
									210702: "鍙ゅ鍖 ",
									210703: "鍑屾渤鍖 ",
									210711: "澶拰鍖 ",
									210726: "榛戝北铡 ",
									210727: "涔夊幕",
									210781: "鍑屾捣宁 ",
									210782: "鍖楅晣宁 ",
									210783: "鍏跺畠鍖 "
								}
							},
							210800: {
								title: "钀ュ彛宁 ",
								districts: {
									210802: "绔椤墠鍖 ",
									210803: "瑗垮竞鍖 ",
									210804: "椴呴奔鍦埚尯",
									210811: "钥佽竟鍖 ",
									210881: "鐩栧窞宁 ",
									210882: "澶х煶妗ュ竞",
									210883: "鍏跺畠鍖 "
								}
							},
							210900: {
								title: "阒沧柊宁 ",
								districts: {
									210902: "娴峰窞鍖 ",
									210903: "鏂伴偙鍖 ",
									210904: "澶钩鍖 ",
									210905: "娓呮渤闂ㄥ尯",
									210911: "缁嗘渤鍖 ",
									210921: "阒沧柊钂椤彝镞忚嚜娌诲幕",
									210922: "褰版铡 ",
									210923: "鍏跺畠鍖 "
								}
							},
							211000: {
								title: "杈介槼宁 ",
								districts: {
									211002: "锏借鍖 ",
									211003: "鏂囧湥鍖 ",
									211004: "瀹忎纻鍖 ",
									211005: "寮挞昵宀尯",
									211011: "澶瓙娌冲尯",
									211021: "杈介槼铡 ",
									211081: "鐏宁 ",
									211082: "鍏跺畠鍖 "
								}
							},
							211100: {
								title: "鐩橀敠宁 ",
								districts: {
									211102: "鍙屽彴瀛愬尯",
									211103: "鍏撮殕鍙板尯",
									211121: "澶ф醇铡 ",
									211122: "鐩桦北铡 ",
									211123: "鍏跺畠鍖 "
								}
							},
							211200: {
								title: "阈佸箔宁 ",
								districts: {
									211202: "阈跺窞鍖 ",
									211204: "娓呮渤鍖 ",
									211221: "阈佸箔铡 ",
									211223: "瑗夸赴铡 ",
									211224: "鏄屽浘铡 ",
									211281: "璋冨叺灞卞竞",
									211282: "寮€铡熷竞",
									211283: "鍏跺畠鍖 "
								}
							},
							211300: {
								title: "链濋槼宁 ",
								districts: {
									211302: "鍙屽鍖 ",
									211303: "榫椤煄鍖 ",
									211321: "链濋槼铡 ",
									211322: "寤哄钩铡 ",
									211324: "锽€锽囨瞾宸︾考钂椤彝镞忚嚜娌诲幕",
									211381: "鍖楃エ宁 ",
									211382: "鍑屾簮宁 ",
									211383: "鍏跺畠鍖 "
								}
							},
							211400: {
								title: "钁奸宀涘竞",
								districts: {
									211402: "杩炲北鍖 ",
									211403: "榫欐腐鍖 ",
									211404: "鍗楃エ鍖 ",
									211421: "缁ヤ腑铡 ",
									211422: "寤烘枪铡 ",
									211481: "鍏村煄宁 ",
									211482: "鍏跺畠鍖 "
								}
							}
						}
					},
					220000: {
						title: "钖夋滠鐪 ",
						cities: {
							220100: {
								title: "闀挎槬宁 ",
								districts: {
									220102: "鍗楀叧鍖  ",
									220103: "瀹借煄鍖 ",
									220104: "链濋槼鍖 ",
									220105: "浜岄亡鍖 ",
									220106: "缁垮洯鍖 ",
									220112: "鍙岄槼鍖  ",
									220122: "鍐滃畨铡 ",
									220181: "涔濆彴宁 ",
									220182: "姒嗘为宁 ",
									220183: "寰锋儬宁 ",
									220184: "楂樻柊鎶€链骇涓氩紑鍙戝尯",
									220185: "姹借溅浜т笟寮€鍙戝尯",
									220186: "缁忔祹鎶€链紑鍙戝尯",
									220187: "鍑€链堟梾娓稿紑鍙戝尯",
									220188: "鍏跺畠鍖 "
								}
							},
							220200: {
								title: "钖夋滠宁 ",
								districts: {
									220202: "鏄岄倯鍖 ",
									220203: "榫欐江鍖 ",
									220204: "鑸硅惀鍖 ",
									220211: "涓版弧鍖 ",
									220221: "姘稿悏铡 ",
									220281: "铔熸渤宁 ",
									220282: "妗︾敻宁 ",
									220283: "鑸掑叞宁 ",
									220284: "纾愮煶宁 ",
									220285: "鍏跺畠鍖 "
								}
							},
							220300: {
								title: "锲涘钩宁 ",
								districts: {
									220302: "阈佽タ鍖 ",
									220303: "阈佷笢鍖 ",
									220322: "姊ㄦ为铡 ",
									220323: "浼婇€氭弧镞忚嚜娌诲幕",
									220381: "鍏富宀竞",
									220382: "鍙岃窘宁 ",
									220383: "鍏跺畠鍖 "
								}
							},
							220400: {
								title: "杈芥簮宁 ",
								districts: {
									220402: "榫椤北鍖 ",
									220403: "瑗垮畨鍖 ",
									220421: "涓滀赴铡 ",
									220422: "涓滆窘铡 ",
									220423: "鍏跺畠鍖 "
								}
							},
							220500: {
								title: "阃氩寲宁 ",
								districts: {
									220502: "涓沧枪鍖 ",
									220503: "浜岄亡姹熷尯",
									220521: "阃氩寲铡 ",
									220523: "杈夊崡铡 ",
									220524: "镆虫渤铡  ",
									220581: "姊呮渤鍙ｅ竞",
									220582: "板嗗畨宁 ",
									220583: "鍏跺畠鍖 "
								}
							},
							220600: {
								title: "锏借北宁 ",
								districts: {
									220602: "鍏亡姹熷尯",
									220621: "鎶氭涧铡 ",
									220622: "闱栧畤铡 ",
									220623: "闀跨槠链濋矞镞忚嚜娌诲幕",
									220625: "姹熸簮铡 ",
									220681: "涓存睙宁 ",
									220682: "鍏跺畠鍖 "
								}
							},
							220700: {
								title: "鏉惧师宁 ",
								districts: {
									220702: "瀹佹睙鍖 ",
									220721: "鍓嶉儹灏旗绥鏂挋鍙ゆ棌镊不铡 ",
									220722: "闀垮箔铡 ",
									220723: "涔惧畨铡 ",
									220724: "镓朵捆铡 ",
									220725: "鍏跺畠鍖 "
								}
							},
							220800: {
								title: "锏借煄宁 ",
								districts: {
									220802: "娲宝鍖 ",
									220821: "闀囱祲铡 ",
									220822: "阃氭铡 ",
									220881: "娲崡宁 ",
									220882: "澶у畨宁 ",
									220883: "鍏跺畠鍖 "
								}
							},
							222400: {
								title: "寤惰竟链濋矞镞忚嚜娌诲窞",
								districts: {
									222401: "寤跺悏宁 ",
									222402: "锲句滑宁 ",
									222403: "鏁﹀寲宁 ",
									222404: "鐝叉槬宁 ",
									222405: "榫欎簳宁 ",
									222406: "鍜岄緳宁 ",
									222424: "姹竻铡 ",
									222426: "瀹夊浘铡 ",
									222427: "鍏跺畠鍖 "
								}
							}
						}
					},
					230000: {
						title: "榛戦緳姹熺渷",
						cities: {
							230100: {
								title: "鍝埚皵婊ㄥ竞",
								districts: {
									230102: "阆挞噷鍖 ",
									230103: "鍗楀矖鍖 ",
									230104: "阆揿鍖 ",
									230106: "棣椤泼鍖 ",
									230107: "锷ㄥ姏鍖 ",
									230108: "骞虫埧鍖 ",
									230109: "鏉惧宝鍖 ",
									230111: "锻煎叞鍖 ",
									230123: "渚濆叞铡 ",
									230124: "鏂规铡 ",
									230125: "瀹惧幕",
									230126: "宸村溅铡 ",
									230127: "链ㄥ叞铡 ",
									230128: "阃氭渤铡 ",
									230129: "寤跺铡 ",
									230181: "阒垮煄宁  ",
									230182: "鍙屽煄宁 ",
									230183: "灏氩织宁 ",
									230184: "浜斿父宁 ",
									230185: "阒垮煄宁 ",
									230186: "鍏跺畠鍖 "
								}
							},
							230200: {
								title: "榻愰绨鍝埚皵宁 ",
								districts: {
									230202: "榫欐瞰鍖 ",
									230203: "寤哄崕鍖 ",
									230204: "阈侀攱鍖 ",
									230205: "鏄傛槀婧尯",
									230206: "瀵屾媺灏斿熀鍖 ",
									230207: "纰惧瓙灞卞尯",
									230208: "姊呴噷鏂揪鏂″皵镞忓尯",
									230221: "榫欐睙铡 ",
									230223: "渚濆畨铡 ",
									230224: "娉版潵铡 ",
									230225: "鐢桦崡铡 ",
									230227: "瀵岃铡 ",
									230229: "鍏嫔北铡 ",
									230230: "鍏嬩笢铡 ",
									230231: "鎷沧硥铡 ",
									230281: "璁锋渤宁 ",
									230282: "鍏跺畠鍖 "
								}
							},
							230300: {
								title: "楦¤タ宁 ",
								districts: {
									230302: "楦″啝鍖 ",
									230303: "鎭掑北鍖 ",
									230304: "婊撮亡鍖 ",
									230305: "姊ㄦ为鍖 ",
									230306: "鍩庡瓙娌冲尯",
									230307: "楹诲北鍖 ",
									230321: "楦′笢铡 ",
									230381: "铏庢滠宁 ",
									230382: "瀵嗗北宁 ",
									230383: "鍏跺畠鍖 "
								}
							},
							230400: {
								title: "楣ゅ矖宁 ",
								districts: {
									230402: "钖戦槼鍖 ",
									230403: "宸ュ啘鍖 ",
									230404: "鍗楀北鍖 ",
									230405: "鍏村畨鍖 ",
									230406: "涓滃北鍖 ",
									230407: "鍏村北鍖 ",
									230421: "钀濆宝铡 ",
									230422: "缁ユ花铡 ",
									230423: "鍏跺畠鍖 "
								}
							},
							230500: {
								title: "鍙岄腑灞卞竞",
								districts: {
									230502: "灏栧北鍖 ",
									230503: "宀笢鍖 ",
									230505: "锲涙楠鍙板尯",
									230506: "瀹濆北鍖 ",
									230521: "板呜搐铡 ",
									230522: "鍙嬭皧铡 ",
									230523: "瀹濇竻铡 ",
									230524: "楗舵渤铡 ",
									230525: "鍏跺畠鍖 "
								}
							},
							230600: {
								title: "澶у简宁 ",
								districts: {
									230602: "钀ㄥ皵锲惧尯",
									230603: "榫椤嚖鍖 ",
									230604: "璁╄儭璺尯",
									230605: "绾㈠矖鍖 ",
									230606: "澶у悓鍖 ",
									230621: "镶囧窞铡 ",
									230622: "镶囨簮铡 ",
									230623: "鏋楃敻铡 ",
									230624: "鏉滃皵浼壒钂椤彝镞忚嚜娌诲幕",
									230625: "鍏跺畠鍖 "
								}
							},
							230700: {
								title: "浼婃槬宁 ",
								districts: {
									230702: "浼婃槬鍖 ",
									230703: "鍗楀胧鍖 ",
									230704: "鍙嫔ソ鍖 ",
									230705: "瑗挎滠鍖 ",
									230706: "缈犲肠鍖 ",
									230707: "鏂伴潚鍖 ",
									230708: "缇庢邯鍖 ",
									230709: "阅戝北灞尯",
									230710: "浜旇惀鍖 ",
									230711: "涔岄┈娌冲尯",
									230712: "姹ゆ椇娌冲尯",
									230713: "宁﹀箔鍖 ",
									230714: "涔屼纷宀尯",
									230715: "绾㈡槦鍖 ",
									230716: "涓婄敇宀尯",
									230722: "鍢夎崼铡 ",
									230781: "阈佸姏宁 ",
									230782: "鍏跺畠鍖 "
								}
							},
							230800: {
								title: "浣虫湪鏂竞",
								districts: {
									230802: "姘哥孩鍖 ",
									230803: "钖戦槼鍖 ",
									230804: "鍓嶈繘鍖 ",
									230805: "涓滈鍖 ",
									230811: "閮婂尯",
									230822: "妗﹀崡铡  ",
									230826: "妗﹀窛铡 ",
									230828: "姹ゅ师铡 ",
									230833: "鎶氲翻铡 ",
									230881: "钖屾睙宁 ",
									230882: "瀵岄敠宁  ",
									230883: "鍏跺畠鍖 "
								}
							},
							230900: {
								title: "涓冨彴娌冲竞",
								districts: {
									230902: "鏂板叴鍖 ",
									230903: "妗冨北鍖 ",
									230904: "锣勫瓙娌冲尯",
									230921: "鍕冨埄铡 ",
									230922: "鍏跺畠鍖 "
								}
							},
							231000: {
								title: "鐗′腹姹熷竞",
								districts: {
									231002: "涓滃畨鍖 ",
									231003: "阒虫槑鍖 ",
									231004: "鐖辨皯鍖 ",
									231005: "瑗垮畨鍖 ",
									231024: "涓滃畞铡 ",
									231025: "鏋楀彛铡 ",
									231081: "缁ヨ姮娌冲竞",
									231083: "娴锋滠宁 ",
									231084: "瀹佸畨宁 ",
									231085: "绌嗘１宁 ",
									231086: "鍏跺畠鍖 "
								}
							},
							231100: {
								title: "榛戞渤宁 ",
								districts: {
									231102: "鐖辫缘鍖 ",
									231121: "瀚╂睙铡 ",
									231123: "阃婂厕铡 ",
									231124: "瀛椤惔铡 ",
									231181: "鍖楀畨宁 ",
									231182: "浜斿ぇ杩炴睁宁 ",
									231183: "鍏跺畠鍖 "
								}
							},
							231200: {
								title: "缁ュ寲宁 ",
								districts: {
									231202: "鍖楁滠鍖 ",
									231221: "链涘铡 ",
									231222: "鍏拌タ铡 ",
									231223: "闱掑念铡 ",
									231224: "搴嗗畨铡 ",
									231225: "鏄庢按铡 ",
									231226: "缁ユ１铡 ",
									231281: "瀹夎揪宁 ",
									231282: "镶囦笢宁 ",
									231283: "娴蜂鸡宁 ",
									231284: "鍏跺畠鍖 "
								}
							},
							232700: {
								title: "澶у叴瀹夊箔鍦板尯",
								districts: {
									232721: "锻肩帅铡 ",
									232722: "濉旀渤铡 ",
									232723: "婕犳渤铡 ",
									232724: "锷犳牸杈惧鍖  ",
									232725: "鍏跺畠鍖 "
								}
							}
						}
					},
					310000: {
						title: "涓婃捣",
						cities: {
							310100: {
								title: "涓婃捣宁 ",
								districts: {
									310101: "榛勬郸鍖 ",
									310103: "鍗㈡咕鍖 ",
									310104: "寰愭眹鍖 ",
									310105: "闀垮畞鍖 ",
									310106: "闱椤畨鍖 ",
									310107: "鏅檧鍖 ",
									310108: "闂稿宝鍖 ",
									310109: "铏瑰彛鍖 ",
									310110: "鏉ㄦ郸鍖 ",
									310112: "闂佃鍖 ",
									310113: "瀹濆北鍖 ",
									310114: "鍢夊畾鍖 ",
									310115: "娴︿笢鏂板尯",
									310116: "阅戝北鍖 ",
									310117: "鏉炬睙鍖 ",
									310118: "闱掓郸鍖 ",
									310119: "鍗楁眹鍖 ",
									310120: "濂夎搐鍖 ",
									310152: "宸濇瞰鍖 ",
									310230: "宕囨槑铡 ",
									310231: "鍏跺畠鍖 "
								}
							}
						}
					},
					320000: {
						title: "姹熻嫃鐪 ",
						cities: {
							320100: {
								title: "鍗椾含宁 ",
								districts: {
									320102: "鐜勬鍖 ",
									320103: "锏戒笅鍖 ",
									320104: "绉︽樊鍖 ",
									320105: "寤洪偤鍖 ",
									320106: "榧撴ゼ鍖 ",
									320107: "涓嫔叧鍖 ",
									320111: "娴﹀彛鍖 ",
									320113: "镙栭湠鍖 ",
									320114: "板ㄨ姳鍙板尯",
									320115: "姹熷畞鍖 ",
									320116: "鍏悎鍖 ",
									320124: "婧ф按铡 ",
									320125: "楂樻烦铡 ",
									320126: "鍏跺畠鍖 "
								}
							},
							320200: {
								title: "镞犻败宁  ",
								districts: {
									320202: "宕囧畨鍖 ",
									320203: "鍗楅昵鍖 ",
									320204: "鍖楀鍖 ",
									320205: "阌″北鍖 ",
									320206: "鎯犲北鍖 ",
									320211: "婊ㄦ箹鍖 ",
									320281: "姹熼槾宁 ",
									320282: "瀹滃叴宁 ",
									320296: "鏂板尯",
									320297: "鍏跺畠鍖  "
								}
							},
							320300: {
								title: "寰愬窞宁 ",
								districts: {
									320302: "榧撴ゼ鍖 ",
									320303: "浜戦緳鍖 ",
									320304: "涔濋噷鍖 ",
									320305: "璐炬豹鍖 ",
									320311: "娉夊北鍖 ",
									320321: "涓板幕",
									320322: "娌涘幕",
									320323: "阈滃北铡 ",
									320324: "镌㈠畞铡 ",
									320381: "鏂版矀宁 ",
									320382: "闾冲窞宁 ",
									320383: "鍏跺畠鍖 "
								}
							},
							320400: {
								title: "宁稿窞宁 ",
								districts: {
									320402: "澶╁畞鍖 ",
									320404: "阍熸ゼ鍖 ",
									320405: "鎴氩鍫板尯",
									320411: "鏂板宝鍖  ",
									320412: "姝﹁繘鍖 ",
									320481: "婧ч槼宁 ",
									320482: "阅戝潧鍖 ",
									320483: "鍏跺畠鍖 "
								}
							},
							320500: {
								title: "鑻忓窞宁 ",
								districts: {
									320502: "娌ф氮鍖 ",
									320503: "骞虫睙鍖 ",
									320504: "阅戦槉鍖 ",
									320505: "铏庝笜鍖 ",
									320506: "钖翠腑鍖 ",
									320507: "鐩稿煄鍖 ",
									320581: "宁哥啛宁 ",
									320582: "寮犲娓竞",
									320583: "鏄嗗北宁  ",
									320584: "钖存睙宁 ",
									320585: "澶粨宁 ",
									320594: "鏂板尯",
									320595: "锲尯",
									320596: "鍏跺畠鍖 "
								}
							},
							320600: {
								title: "鍗楅€氩竞",
								districts: {
									320602: "宕囧窛鍖 ",
									320611: "娓椄鍖 ",
									320612: "阃氩窞鍖 ",
									320621: "娴峰畨铡 ",
									320623: "濡備笢铡 ",
									320681: "钖笢宁 ",
									320682: "濡傜殝宁 ",
									320683: "阃氩窞宁 ",
									320684: "娴烽棬宁 ",
									320693: "寮€鍙戝尯",
									320694: "鍏跺畠鍖 "
								}
							},
							320700: {
								title: "杩炰簯娓竞",
								districts: {
									320703: "杩炰簯鍖 ",
									320705: "鏂版郸鍖 ",
									320706: "娴峰窞鍖 ",
									320721: "璧ｆ铡 ",
									320722: "涓沧捣铡 ",
									320723: "鐏屼簯铡 ",
									320724: "鐏屽崡铡 ",
									320725: "鍏跺畠鍖 "
								}
							},
							320800: {
								title: "娣畨宁 ",
								districts: {
									320802: "娓呮渤鍖 ",
									320803: "妤氩窞鍖 ",
									320804: "娣槾鍖 ",
									320811: "娓呮郸鍖 ",
									320826: "娑熸按铡  ",
									320829: "娲辰铡 ",
									320830: "鐩辩湙铡 ",
									320831: "阅戞箹铡 ",
									320832: "鍏跺畠鍖 "
								}
							},
							320900: {
								title: "鐩愬煄宁 ",
								districts: {
									320902: "浜箹鍖 ",
									320903: "鐩愰兘鍖 ",
									320921: "鍝嶆按铡 ",
									320922: "婊ㄦ捣铡 ",
									320923: "阒滃畞铡 ",
									320924: "灏勯槼铡 ",
									320925: "寤烘箹铡 ",
									320981: "涓滃彴宁 ",
									320982: "澶т赴宁 ",
									320983: "鍏跺畠鍖 "
								}
							},
							321000: {
								title: "镓窞宁 ",
								districts: {
									321002: "骞块栎鍖 ",
									321003: "闾楁睙鍖 ",
									321011: "缁存壃鍖 ",
									321023: "瀹濆簲铡 ",
									321081: "浠緛宁 ",
									321084: "楂橀偖宁 ",
									321088: "姹熼兘宁 ",
									321092: "缁忔祹寮€鍙戝尯",
									321093: "鍏跺畠鍖 "
								}
							},
							321100: {
								title: "闀囨睙宁 ",
								districts: {
									321102: "浜彛鍖 ",
									321111: "娑﹀窞鍖 ",
									321112: "涓瑰缅鍖 ",
									321181: "涓归槼宁 ",
									321182: "镓腑宁 ",
									321183: "鍙ュ宁 ",
									321184: "鍏跺畠鍖 "
								}
							},
							321200: {
								title: "娉板窞宁 ",
								districts: {
									321202: "娴烽栎鍖 ",
									321203: "楂樻腐鍖 ",
									321281: "鍏村寲宁 ",
									321282: "闱栨睙宁 ",
									321283: "娉板叴宁 ",
									321284: "濮滃牥宁 ",
									321285: "鍏跺畠鍖 "
								}
							},
							321300: {
								title: "瀹胯縼宁 ",
								districts: {
									321302: "瀹垮煄鍖 ",
									321311: "瀹胯鲍鍖 ",
									321322: "娌槼铡 ",
									321323: "娉楅槼铡 ",
									321324: "娉楁椽铡 ",
									321325: "鍏跺畠鍖 "
								}
							}
						}
					},
					330000: {
						title: "娴欐睙鐪  ",
						cities: {
							330100: {
								title: "鏉窞宁 ",
								districts: {
									330102: "涓婂煄鍖 ",
									330103: "涓嫔煄鍖 ",
									330104: "姹熷共鍖  ",
									330105: "鎷卞鍖 ",
									330106: "瑗挎箹鍖 ",
									330108: "婊ㄦ睙鍖 ",
									330109: "钀у北鍖 ",
									330110: "浣欐涩鍖  ",
									330122: "妗愬簮铡 ",
									330127: "娣冲畨铡 ",
									330182: "寤哄痉宁 ",
									330183: "瀵岄槼宁 ",
									330185: "涓村畨宁  ",
									330186: "鍏跺畠鍖 "
								}
							},
							330200: {
								title: "瀹佹尝宁 ",
								districts: {
									330203: "娴锋洐鍖 ",
									330204: "姹熶笢鍖 ",
									330205: "姹熷宝鍖 ",
									330206: "鍖椾粦鍖 ",
									330211: "闀囨捣鍖 ",
									330212: "閯炲窞鍖 ",
									330225: "璞″北铡 ",
									330226: "瀹佹捣铡 ",
									330281: "浣椤宁 ",
									330282: "鎱堟邯宁 ",
									330283: "濂夊寲宁 ",
									330284: "鍏跺畠鍖 "
								}
							},
							330300: {
								title: "娓╁窞宁 ",
								districts: {
									330302: "楣垮煄鍖 ",
									330303: "榫欐咕鍖 ",
									330304: "鐡捣鍖 ",
									330322: "娲炲ご铡 ",
									330324: "姘稿槈铡 ",
									330326: "骞抽槼铡 ",
									330327: "鑻嶅崡铡 ",
									330328: "鏂囨垚铡 ",
									330329: "娉伴『铡 ",
									330381: "鐟炲畨宁 ",
									330382: "涔愭竻宁 ",
									330383: "鍏跺畠鍖 "
								}
							},
							330400: {
								title: "鍢夊叴宁 ",
								districts: {
									330402: "鍗楁箹鍖 ",
									330411: "绉€娲插尯",
									330421: "鍢夊杽铡 ",
									330424: "娴风洂铡 ",
									330481: "娴峰畞宁 ",
									330482: "骞虫箹宁 ",
									330483: "妗愪埂宁 ",
									330484: "鍏跺畠鍖 "
								}
							},
							330500: {
								title: "婀栧窞宁 ",
								districts: {
									330502: "钖村叴鍖 ",
									330503: "鍗楁禂鍖 ",
									330521: "寰锋竻铡 ",
									330522: "闀垮叴铡 ",
									330523: "瀹夊悏铡 ",
									330524: "鍏跺畠鍖 "
								}
							},
							330600: {
								title: "缁嶅叴宁 ",
								districts: {
									330602: "瓒婂煄鍖 ",
									330621: "缁嶅叴铡 ",
									330624: "鏂版枪铡 ",
									330681: "璇告毃宁 ",
									330682: "涓婅凳宁 ",
									330683: "宓婂窞宁 ",
									330684: "鍏跺畠鍖 "
								}
							},
							330700: {
								title: "阅戝崕宁 ",
								districts: {
									330702: "濠哄煄鍖 ",
									330703: "阅戜笢鍖  ",
									330723: "姝︿箟铡 ",
									330726: "娴︽睙铡 ",
									330727: "纾愬畨铡 ",
									330781: "鍏版邯宁 ",
									330782: "涔変箤宁  ",
									330783: "涓滈槼宁 ",
									330784: "姘稿悍宁 ",
									330785: "鍏跺畠鍖 "
								}
							},
							330800: {
								title: "琛㈠窞宁 ",
								districts: {
									330802: "镆煄鍖 ",
									330803: "琛㈡睙鍖 ",
									330822: "宁稿北铡 ",
									330824: "寮€鍖栧幕",
									330825: "榫欐父铡 ",
									330881: "姹熷北宁 ",
									330882: "鍏跺畠鍖 "
								}
							},
							330900: {
								title: "鑸熷北宁 ",
								districts: {
									330902: "瀹氭捣鍖 ",
									330903: "鏅檧鍖 ",
									330921: "宀卞北铡 ",
									330922: "宓婃硹铡 ",
									330923: "鍏跺畠鍖 "
								}
							},
							331000: {
								title: "鍙板窞宁 ",
								districts: {
									331002: "妞掓睙鍖 ",
									331003: "榛勫博鍖 ",
									331004: "璺ˉ鍖 ",
									331021: "鐜夌幆铡 ",
									331022: "涓夐棬铡 ",
									331023: "澶╁彴铡 ",
									331024: "浠椤眳铡 ",
									331081: "娓╁箔宁 ",
									331082: "涓存捣宁 ",
									331083: "鍏跺畠鍖 "
								}
							},
							331100: {
								title: "涓芥按宁 ",
								districts: {
									331102: "銮查兘鍖 ",
									331121: "闱掔敯铡  ",
									331122: "缂欎簯铡 ",
									331123: "阆傛枪铡 ",
									331124: "鏉鹃槼铡 ",
									331125: "浜戝拰铡 ",
									331126: "搴嗗崖铡  ",
									331127: "鏅畞鐣叉棌镊不铡 ",
									331181: "榫欐硥宁 ",
									331182: "鍏跺畠鍖 "
								}
							}
						}
					},
					340000: {
						title: "瀹夊窘鐪 ",
						cities: {
							340100: {
								title: "钖堣伟宁 ",
								districts: {
									340102: "鐟舵捣鍖 ",
									340103: "搴愰槼鍖 ",
									340104: "铚€灞卞尯",
									340111: "鍖呮渤鍖 ",
									340121: "闀夸赴铡 ",
									340122: "镶ヤ笢铡 ",
									340123: "镶ヨタ铡 ",
									340151: "楂樻柊鍖 ",
									340191: "涓尯",
									340192: "鍏跺畠鍖 ",
									341400: "宸㈡箹宁 ",
									341402: "灞呭发鍖 ",
									341421: "搴愭睙铡  "
								}
							},
							340200: {
								title: "鑺沧箹宁 ",
								districts: {
									340202: "闀沧箹鍖 ",
									340203: "寮嬫睙鍖 ",
									340207: "楦犳睙鍖 ",
									340208: "涓夊北鍖 ",
									340221: "鑺沧箹铡 ",
									340222: "绻佹枪铡 ",
									340223: "鍗楅栎铡 ",
									340224: "鍏跺畠鍖 ",
									341422: "镞犱负铡 "
								}
							},
							340300: {
								title: "铓屽煚宁 ",
								districts: {
									340302: "榫椤瓙婀栧尯",
									340303: "铓屽北鍖 ",
									340304: "绂逛细鍖 ",
									340311: "娣笂鍖 ",
									340321: "镐€杩滃幕",
									340322: "浜旀渤铡 ",
									340323: "锲洪晣铡 ",
									340324: "鍏跺畠鍖 "
								}
							},
							340400: {
								title: "娣崡宁 ",
								districts: {
									340402: "澶ч€氩尯",
									340403: "鐢板搴靛尯",
									340404: "璋㈠板嗗尯",
									340405: "鍏叕灞卞尯",
									340406: "娼橀泦鍖 ",
									340421: "鍑ゅ彴铡 ",
									340422: "鍏跺畠鍖 "
								}
							},
							340500: {
								title: "椹瀺灞卞竞",
								districts: {
									340502: "阅戝搴勫尯",
									340503: "鑺卞北鍖 ",
									340504: "板ㄥ北鍖 ",
									340521: "褰撴秱铡 ",
									340522: "鍏跺畠鍖 ",
									341423: "钖北铡 ",
									341424: "鍜屽幕"
								}
							},
							340600: {
								title: "娣宝宁 ",
								districts: {
									340602: "鏉滈泦鍖 ",
									340603: "鐩稿北鍖 ",
									340604: "鐑埚北鍖 ",
									340621: "婵夋邯铡  ",
									340622: "鍏跺畠鍖 "
								}
							},
							340700: {
								title: "阈滈栎宁 ",
								districts: {
									340702: "阈滃畼灞卞尯",
									340703: "镫瓙灞卞尯",
									340711: "閮婂尯",
									340721: "阈滈栎铡 ",
									340722: "鍏跺畠鍖 "
								}
							},
							340800: {
								title: "瀹夊简宁 ",
								districts: {
									340802: "杩庢睙鍖 ",
									340803: "澶ц鍖 ",
									340811: "瀹灭鍖 ",
									340822: "镐€瀹佸幕",
									340823: "鏋为槼铡  ",
									340824: "娼滃北铡 ",
									340825: "澶箹铡 ",
									340826: "瀹挎涧铡 ",
									340827: "链涙睙铡 ",
									340828: "宀宠タ铡  ",
									340881: "妗愬煄宁 ",
									340882: "鍏跺畠鍖 "
								}
							},
							341000: {
								title: "榛勫北宁 ",
								districts: {
									341002: "灞邯鍖 ",
									341003: "榛勫北鍖 ",
									341004: "寰借窞鍖 ",
									341021: "姝椤幕",
									341022: "浼戝畞铡 ",
									341023: "榛熷幕",
									341024: "绁侀棬铡 ",
									341025: "鍏跺畠鍖 "
								}
							},
							341100: {
								title: "婊佸窞宁 ",
								districts: {
									341102: "鐞呯悐鍖 ",
									341103: "鍗楄隘鍖 ",
									341122: "鏉ュ畨铡 ",
									341124: "鍏ㄦ铡 ",
									341125: "瀹氲翻铡 ",
									341126: "鍑ら槼铡 ",
									341181: "澶╅昵宁 ",
									341182: "鏄庡厜宁 ",
									341183: "鍏跺畠鍖 "
								}
							},
							341200: {
								title: "阒滈槼宁 ",
								districts: {
									341202: "棰嶅窞鍖 ",
									341203: "棰崭笢鍖 ",
									341204: "棰嶆硥鍖 ",
									341221: "涓存硥铡 ",
									341222: "澶拰铡  ",
									341225: "阒滃崡铡 ",
									341226: "棰崭笂铡 ",
									341282: "鐣岄宁 ",
									341283: "鍏跺畠鍖 "
								}
							},
							341300: {
								title: "瀹垮窞宁 ",
								districts: {
									341302: "鍩囨ˉ鍖 ",
									341321: "镰€灞卞幕",
									341322: "钀у幕",
									341323: "鐏电挧铡 ",
									341324: "娉楀幕",
									341325: "鍏跺畠鍖 "
								}
							},
							341500: {
								title: "鍏畨宁 ",
								districts: {
									341502: "阅戝畨鍖 ",
									341503: "瑁曞畨鍖 ",
									341521: "瀵垮幕",
									341522: "暗嶉偙铡 ",
									341523: "鑸掑煄铡 ",
									341524: "阅戝铡 ",
									341525: "暗嶅北铡  ",
									341526: "鍏跺畠鍖 "
								}
							},
							341600: {
								title: "浜冲窞宁 ",
								districts: {
									341602: "璋煄鍖 ",
									341621: "娑￠槼铡 ",
									341622: "钂椤煄铡 ",
									341623: "鍒╄緵铡 ",
									341624: "鍏跺畠鍖 "
								}
							},
							341700: {
								title: "姹犲窞宁 ",
								districts: {
									341702: "璐垫睁鍖 ",
									341721: "涓滆呖铡 ",
									341722: "鐭冲彴铡 ",
									341723: "闱掗槼铡 ",
									341724: "鍏跺畠鍖 "
								}
							},
							341800: {
								title: "瀹ｅ煄宁 ",
								districts: {
									341802: "瀹ｅ窞鍖 ",
									341821: "閮庢邯铡 ",
									341822: "骞垮痉铡 ",
									341823: "娉惧幕",
									341824: "缁╂邯铡 ",
									341825: "镞屽痉铡 ",
									341881: "瀹佸浗宁 ",
									341882: "鍏跺畠鍖 "
								}
							}
						}
					},
					350000: {
						title: "绂忓缓鐪 ",
						cities: {
							350100: {
								title: "绂忓窞宁 ",
								districts: {
									350102: "榧撴ゼ鍖  ",
									350103: "鍙版睙鍖 ",
									350104: "浠揿北鍖 ",
									350105: "椹熬鍖 ",
									350111: "鏅嫔畨鍖 ",
									350121: "闂戒警铡  ",
									350122: "杩炴睙铡 ",
									350123: "缃楁簮铡 ",
									350124: "闂芥竻铡 ",
									350125: "姘告嘲铡 ",
									350128: "骞虫江铡  ",
									350181: "绂忔竻宁 ",
									350182: "闀夸箰宁 ",
									350183: "鍏跺畠鍖 "
								}
							},
							350200: {
								title: "铡﹂棬宁 ",
								districts: {
									350203: "镐濇槑鍖 ",
									350205: "娴锋钵鍖 ",
									350206: "婀栭噷鍖 ",
									350211: "板嗙编鍖 ",
									350212: "钖屽畨鍖 ",
									350213: "缈斿畨鍖 ",
									350214: "鍏跺畠鍖 "
								}
							},
							350300: {
								title: "銮嗙敯宁 ",
								districts: {
									350302: "鍩庡帰鍖 ",
									350303: "娑垫睙鍖 ",
									350304: "钻斿煄鍖 ",
									350305: "绉€灞垮尯",
									350322: "浠欐父铡 ",
									350323: "鍏跺畠鍖 "
								}
							},
							350400: {
								title: "涓夋槑宁 ",
								districts: {
									350402: "姊呭垪鍖 ",
									350403: "涓夊崖鍖 ",
									350421: "鏄庢邯铡 ",
									350423: "娓呮祦铡 ",
									350424: "瀹佸寲铡 ",
									350425: "澶х敯铡 ",
									350426: "灏ゆ邯铡 ",
									350427: "娌椤幕",
									350428: "灏嗕箰铡 ",
									350429: "娉板畞铡 ",
									350430: "寤哄畞铡 ",
									350481: "姘稿畨宁 ",
									350482: "鍏跺畠鍖 "
								}
							},
							350500: {
								title: "娉夊窞宁 ",
								districts: {
									350502: "椴ゅ煄鍖 ",
									350503: "涓版辰鍖 ",
									350504: "娲涙睙鍖 ",
									350505: "娉夋腐鍖 ",
									350521: "鎯犲畨铡 ",
									350524: "瀹夋邯铡 ",
									350525: "姘告槬铡 ",
									350526: "寰峰寲铡 ",
									350527: "阅戦棬铡 ",
									350581: "鐭崇嫯宁 ",
									350582: "鏅嬫睙宁 ",
									350583: "鍗楀畨宁 ",
									350584: "鍏跺畠鍖 "
								}
							},
							350600: {
								title: "婕冲窞宁 ",
								districts: {
									350602: "鑺楀煄鍖 ",
									350603: "榫欐枃鍖 ",
									350622: "浜戦渼铡 ",
									350623: "婕虫郸铡 ",
									350624: "璇忓畨铡 ",
									350625: "闀挎嘲铡 ",
									350626: "涓滃北铡 ",
									350627: "鍗楅潠铡 ",
									350628: "骞冲拰铡 ",
									350629: "鍗庡畨铡 ",
									350681: "榫欐捣宁 ",
									350682: "鍏跺畠鍖 "
								}
							},
							350700: {
								title: "鍗楀钩宁 ",
								districts: {
									350702: "寤跺钩鍖 ",
									350721: "椤烘枪铡 ",
									350722: "娴﹀煄铡 ",
									350723: "鍏夋辰铡 ",
									350724: "鏉炬邯铡 ",
									350725: "鏀垮拰铡 ",
									350781: "闾垫宁 ",
									350782: "姝﹀し灞卞竞",
									350783: "寤虹摨宁 ",
									350784: "寤洪槼宁 ",
									350785: "鍏跺畠鍖 "
								}
							},
							350800: {
								title: "榫椤博宁  ",
								districts: {
									350802: "鏂扮绥鍖 ",
									350821: "闀挎眬铡 ",
									350822: "姘稿畾铡 ",
									350823: "涓婃涩铡 ",
									350824: "姝﹀钩铡 ",
									350825: "杩炲煄铡 ",
									350881: "婕冲钩宁 ",
									350882: "鍏跺畠鍖 "
								}
							},
							350900: {
								title: "瀹佸痉宁 ",
								districts: {
									350902: "钑夊煄鍖 ",
									350921: "暗炴郸铡 ",
									350922: "鍙ょ敯铡 ",
									350923: "灞忓崡铡 ",
									350924: "瀵垮畞铡 ",
									350925: "锻ㄥ畞铡 ",
									350926: "镆樿崳铡 ",
									350981: "绂忓畨宁 ",
									350982: "绂忛紟宁 ",
									350983: "鍏跺畠鍖 "
								}
							}
						}
					},
					360000: {
						title: "姹熻タ鐪 ",
						cities: {
							360100: {
								title: "鍗楁枪宁 ",
								districts: {
									360102: "涓沧箹鍖 ",
									360103: "瑗挎箹鍖 ",
									360104: "闱掍簯璋卞尯",
									360105: "婀鹃噷鍖 ",
									360111: "闱掑北婀栧尯",
									360121: "鍗楁枪铡 ",
									360122: "鏂板缓铡 ",
									360123: "瀹変箟铡 ",
									360124: "杩涜搐铡 ",
									360125: "绾㈣胺婊╂柊鍖 ",
									360126: "缁忔祹鎶€链紑鍙戝尯",
									360127: "鏄屽宝鍖 ",
									360128: "鍏跺畠鍖 "
								}
							},
							360200: {
								title: "鏅痉闀囧竞",
								districts: {
									360202: "鏄屾睙鍖 ",
									360203: "鐝犲北鍖 ",
									360222: "娴铡 ",
									360281: "涔愬钩宁 ",
									360282: "鍏跺畠鍖 "
								}
							},
							360300: {
								title: "钀崭埂宁 ",
								districts: {
									360302: "瀹夋簮鍖 ",
									360313: "婀树笢鍖 ",
									360321: "銮茶姳铡  ",
									360322: "涓婃床铡 ",
									360323: "鑺︽邯铡 ",
									360324: "鍏跺畠鍖 "
								}
							},
							360400: {
								title: "涔濇睙宁 ",
								districts: {
									360402: "搴愬北鍖 ",
									360403: "娴旈槼鍖 ",
									360421: "涔濇睙铡 ",
									360423: "姝﹀畞铡 ",
									360424: "淇按铡 ",
									360425: "姘镐慨铡 ",
									360426: "寰峰畨铡 ",
									360427: "鏄熷瓙铡 ",
									360428: "閮芥枪铡 ",
									360429: "婀栧彛铡 ",
									360430: "褰辰铡 ",
									360481: "鐟炴枪宁 ",
									360482: "鍏跺畠鍖 "
								}
							},
							360500: {
								title: "鏂颁捆宁 ",
								districts: {
									360502: "娓濇按鍖 ",
									360521: "鍒嗗疁铡 ",
									360522: "鍏跺畠鍖 "
								}
							},
							360600: {
								title: "楣版江宁 ",
								districts: {
									360602: "链堟箹鍖 ",
									360622: "浣欐睙铡 ",
									360681: "璐垫邯宁 ",
									360682: "鍏跺畠鍖 "
								}
							},
							360700: {
								title: "璧ｅ窞宁 ",
								districts: {
									360702: "绔犺础鍖 ",
									360721: "璧ｅ幕",
									360722: "淇′赴铡 ",
									360723: "澶т捆铡 ",
									360724: "涓婄姽铡 ",
									360725: "宕囦箟铡 ",
									360726: "瀹夎翻铡 ",
									360727: "榫椤崡铡 ",
									360728: "瀹氩崡铡 ",
									360729: "鍏ㄥ崡铡 ",
									360730: "瀹侀兘铡 ",
									360731: "浜庨兘铡 ",
									360732: "鍏村浗铡 ",
									360733: "浼氭枪铡 ",
									360734: "瀵讳箤铡 ",
									360735: "鐭冲煄铡 ",
									360751: "榛勯噾鍖 ",
									360781: "鐟为噾宁 ",
									360782: "鍗楀悍宁 ",
									360783: "鍏跺畠鍖 "
								}
							},
							360800: {
								title: "钖夊畨宁 ",
								districts: {
									360802: "钖夊窞鍖 ",
									360803: "闱掑师鍖 ",
									360821: "钖夊畨铡 ",
									360822: "钖夋按铡 ",
									360823: "宄℃睙铡 ",
									360824: "鏂板共铡 ",
									360825: "姘镐赴铡 ",
									360826: "娉板拰铡 ",
									360827: "阆效窛铡 ",
									360828: "涓囧畨铡 ",
									360829: "瀹夌铡 ",
									360830: "姘告柊铡 ",
									360881: "浜曞念灞卞竞",
									360882: "鍏跺畠鍖 "
								}
							},
							360900: {
								title: "瀹沧槬宁 ",
								districts: {
									360902: "琚佸窞鍖 ",
									360921: "濂夋柊铡 ",
									360922: "涓囱浇铡 ",
									360923: "涓婇珮铡 ",
									360924: "瀹滀赴铡 ",
									360925: "闱栧畨铡 ",
									360926: "阈滈紦铡 ",
									360981: "涓板煄宁 ",
									360982: "妯熸为宁 ",
									360983: "楂桦畨宁 ",
									360984: "鍏跺畠鍖 "
								}
							},
							361000: {
								title: "鎶氩窞宁 ",
								districts: {
									361002: "涓村窛鍖 ",
									361021: "鍗楀煄铡 ",
									361022: "榛庡窛铡 ",
									361023: "鍗椾赴铡 ",
									361024: "宕囦粊铡 ",
									361025: "涔愬畨铡 ",
									361026: "瀹滈粍铡 ",
									361027: "阅戞邯铡 ",
									361028: "璧勬邯铡 ",
									361029: "涓滀埂铡 ",
									361030: "骞挎枪铡 ",
									361031: "鍏跺畠鍖 "
								}
							},
							361100: {
								title: "涓婇ザ宁 ",
								districts: {
									361102: "淇″窞鍖 ",
									361121: "涓婇ザ铡 ",
									361122: "骞夸赴铡 ",
									361123: "鐜夊北铡 ",
									361124: "阈呭北铡 ",
									361125: "妯嘲铡 ",
									361126: "寮嬮槼铡 ",
									361127: "浣椤共铡 ",
									361128: "閯遍槼铡 ",
									361129: "涓囧勾铡 ",
									361130: "濠烘簮铡 ",
									361181: "寰峰叴宁 ",
									361182: "鍏跺畠鍖 "
								}
							}
						}
					},
					370000: {
						title: "灞变笢鐪 ",
						cities: {
							370100: {
								title: "娴庡崡宁 ",
								districts: {
									370102: "铡嗕笅鍖 ",
									370103: "宁备腑鍖 ",
									370104: "妲愯崼鍖 ",
									370105: "澶╂ˉ鍖 ",
									370112: "铡嗗煄鍖 ",
									370113: "闀挎竻鍖 ",
									370124: "骞抽槾铡 ",
									370125: "娴庨槼铡 ",
									370126: "鍟嗘渤铡 ",
									370181: "绔犱笜宁 ",
									370182: "鍏跺畠鍖 "
								}
							},
							370200: {
								title: "闱掑矝宁 ",
								districts: {
									370202: "宁效崡鍖 ",
									370203: "宁效宝鍖 ",
									370205: "锲涙楠鍖 ",
									370211: "榛勫矝鍖 ",
									370212: "宕效北鍖 ",
									370213: "鏉庢钵鍖 ",
									370214: "鍩庨槼鍖 ",
									370251: "寮€鍙戝尯",
									370281: "鑳跺窞宁 ",
									370282: "鍗冲ⅷ宁 ",
									370283: "骞冲害宁 ",
									370284: "鑳跺崡宁 ",
									370285: "銮辫タ宁 ",
									370286: "鍏跺畠鍖 "
								}
							},
							370300: {
								title: "娣勫崥宁 ",
								districts: {
									370302: "娣勫窛鍖 ",
									370303: "寮犲簵鍖 ",
									370304: "鍗氩北鍖 ",
									370305: "涓存穭鍖  ",
									370306: "锻ㄦ沩鍖 ",
									370321: "妗揿彴铡 ",
									370322: "楂橀潚铡 ",
									370323: "娌傛簮铡 ",
									370324: "鍏跺畠鍖  "
								}
							},
							370400: {
								title: "鏋ｅ箪宁 ",
								districts: {
									370402: "宁备腑鍖 ",
									370403: "钖涘煄鍖 ",
									370404: "宄勫煄鍖 ",
									370405: "鍙板效搴勫尯",
									370406: "灞变涵鍖 ",
									370481: "婊曞窞宁 ",
									370482: "鍏跺畠鍖 "
								}
							},
							370500: {
								title: "涓滆惀宁 ",
								districts: {
									370502: "涓滆惀鍖 ",
									370503: "娌冲彛鍖 ",
									370521: "鍨﹀埄铡 ",
									370522: "鍒╂触铡 ",
									370523: "骞块ザ铡 ",
									370589: "瑗垮煄鍖 ",
									370590: "涓滃煄鍖 ",
									370591: "鍏跺畠鍖 "
								}
							},
							370600: {
								title: "鐑熷彴宁 ",
								districts: {
									370602: "鑺濈綐鍖 ",
									370611: "绂忓北鍖 ",
									370612: "鐗熷钩鍖 ",
									370613: "銮卞北鍖 ",
									370634: "闀垮矝铡 ",
									370681: "榫椤彛宁 ",
									370682: "銮遍槼宁 ",
									370683: "銮卞窞宁 ",
									370684: "钃幈宁  ",
									370685: "鎷涜翻宁 ",
									370686: "镙栭湠宁 ",
									370687: "娴烽槼宁 ",
									370688: "鍏跺畠鍖 "
								}
							},
							370700: {
								title: "娼嶅泼宁 ",
								districts: {
									370702: "娼嶅煄鍖 ",
									370703: "瀵掍涵鍖 ",
									370704: "鍧婂瓙鍖 ",
									370705: "濂庢枃鍖 ",
									370724: "涓存凑铡 ",
									370725: "鏄屼箰铡 ",
									370751: "寮€鍙戝尯",
									370781: "闱掑窞宁 ",
									370782: "楂樻柊鍖 ",
									370783: "瀵垮厜宁 ",
									370784: "瀹変笜宁 ",
									370785: "楂桦瘑宁 ",
									370786: "鏄岄倯宁 ",
									370787: "鍏跺畠鍖 ",
									370752: "婊ㄦ捣鍖 "
								}
							},
							370800: {
								title: "娴庡畞宁 ",
								districts: {
									370802: "宁备腑鍖 ",
									370811: "浠诲煄鍖 ",
									370826: "寰北铡 ",
									370827: "楸煎彴铡 ",
									370828: "阅戜埂铡 ",
									370829: "鍢夌ゥ铡 ",
									370830: "姹朵笂铡 ",
									370831: "娉楁按铡 ",
									370832: "姊佸北铡 ",
									370881: "旋查槣宁 ",
									370882: "鍏栧窞宁 ",
									370883: "闾瑰煄宁 ",
									370884: "鍏跺畠鍖 "
								}
							},
							370900: {
								title: "娉板畨宁 ",
								districts: {
									370902: "娉板北鍖 ",
									370903: "宀卞渤鍖 ",
									370921: "瀹侀槼铡 ",
									370923: "涓滃钩铡 ",
									370982: "鏂版嘲宁 ",
									370983: "镶ュ煄宁 ",
									370984: "鍏跺畠鍖 "
								}
							},
							371000: {
								title: "濞佹捣宁 ",
								districts: {
									371002: "鐜繝鍖 ",
									371081: "鏂囩橱宁 ",
									371082: "钻ｆ垚宁 ",
									371083: "涔冲北宁 ",
									371084: "鍏跺畠鍖 "
								}
							},
							371100: {
								title: "镞ョ收宁 ",
								districts: {
									371102: "涓沧腐鍖 ",
									371103: "宀氩北鍖 ",
									371121: "浜旇幉铡 ",
									371122: "銮掑幕",
									371123: "鍏跺畠鍖 "
								}
							},
							371200: {
								title: "銮辫姕宁 ",
								districts: {
									371202: "銮卞煄鍖 ",
									371203: "阍㈠煄鍖 ",
									371204: "鍏跺畠鍖 "
								}
							},
							371300: {
								title: "涓存矀宁 ",
								districts: {
									371302: "鍏板北鍖 ",
									371311: "缃楀箪鍖 ",
									371312: "娌充笢鍖 ",
									371321: "娌效崡铡 ",
									371322: "閮煄铡 ",
									371323: "娌傛按铡 ",
									371324: "鑻嶅北铡 ",
									371325: "璐瑰幕",
									371326: "骞抽倯铡  ",
									371327: "銮掑崡铡 ",
									371328: "钂欓槾铡 ",
									371329: "涓存箔铡 ",
									371330: "鍏跺畠鍖 "
								}
							},
							371400: {
								title: "寰峰窞宁 ",
								districts: {
									371402: "寰峰煄鍖 ",
									371421: "闄靛幕",
									371422: "瀹佹触铡  ",
									371423: "搴嗕簯铡 ",
									371424: "涓撮倯铡 ",
									371425: "榻愭渤铡 ",
									371426: "骞冲师铡 ",
									371427: "澶忔触铡  ",
									371428: "姝﹀煄铡 ",
									371451: "寮€鍙戝尯",
									371481: "涔愰栎宁 ",
									371482: "绂瑰煄宁 ",
									371483: "鍏跺畠鍖  "
								}
							},
							371500: {
								title: "镵婂煄宁 ",
								districts: {
									371502: "涓沧枪搴滃尯",
									371521: "阒宠胺铡 ",
									371522: "銮桦幕",
									371523: "锣屽钩铡 ",
									371524: "涓滈樋铡 ",
									371525: "鍐犲幕",
									371526: "楂桦攼铡 ",
									371581: "涓存竻宁 ",
									371582: "鍏跺畠鍖 "
								}
							},
							371600: {
								title: "婊ㄥ窞宁 ",
								districts: {
									371602: "婊ㄥ煄鍖 ",
									371621: "鎯犳皯铡 ",
									371622: "阒充俊铡 ",
									371623: "镞犳＃铡 ",
									371624: "娌惧寲铡 ",
									371625: "鍗氩叴铡 ",
									371626: "闾瑰钩铡 ",
									371627: "鍏跺畠鍖 "
								}
							},
							371700: {
								title: "凿忔辰宁 ",
								districts: {
									371702: "鐗′腹鍖 ",
									371721: "旋瑰幕",
									371722: "鍗曞幕",
									371723: "鎴愭铡 ",
									371724: "宸ㄩ当铡 ",
									371725: "閮揿煄铡 ",
									371726: "閯勫煄铡 ",
									371727: "瀹氶櫠铡 ",
									371728: "涓沧槑铡 ",
									371729: "鍏跺畠鍖 "
								}
							}
						}
					},
					410000: {
						title: "娌冲崡鐪 ",
						cities: {
							410100: {
								title: "閮戝窞宁 ",
								districts: {
									410102: "涓师鍖 ",
									410103: "浜屼竷鍖 ",
									410104: "绠″煄锲炴棌鍖 ",
									410105: "阅戞按鍖 ",
									410106: "涓婅鍖 ",
									410108: "鎯犳祹鍖 ",
									410122: "涓墴铡 ",
									410181: "宸╀箟宁 ",
									410182: "钻ラ槼宁 ",
									410183: "鏂板瘑宁 ",
									410184: "鏂伴儜宁 ",
									410185: "锏诲皝宁 ",
									410186: "閮戜笢鏂板尯",
									410187: "楂樻柊鍖 ",
									410188: "鍏跺畠鍖 "
								}
							},
							410200: {
								title: "寮€灏佸竞",
								districts: {
									410202: "榫欎涵鍖 ",
									410203: "椤烘渤锲炴棌鍖 ",
									410204: "榧撴ゼ鍖 ",
									410205: "绂圭帇鍙板尯",
									410211: "阅戞槑鍖 ",
									410221: "鏉炲幕",
									410222: "阃氲铡 ",
									410223: "灏夋皬铡 ",
									410224: "寮€灏佸幕",
									410225: "鍏拌€冨幕",
									410226: "鍏跺畠鍖 "
								}
							},
							410300: {
								title: "娲涢槼宁 ",
								districts: {
									410302: "钥佸煄鍖 ",
									410303: "瑗垮伐鍖 ",
									410304: "寤涙渤锲炴棌鍖 ",
									410305: "娑цタ鍖 ",
									410306: "钖夊埄鍖 ",
									410307: "娲涢緳鍖 ",
									410322: "瀛熸触铡 ",
									410323: "鏂板畨铡 ",
									410324: "镙惧窛铡 ",
									410325: "宓╁幕",
									410326: "姹濋槼铡 ",
									410327: "瀹滈槼铡 ",
									410328: "娲涘畞铡 ",
									410329: "浼婂窛铡 ",
									410381: "锅冨笀宁 ",
									471004: "楂樻柊鍖 ",
									471005: "鍏跺畠鍖 "
								}
							},
							410400: {
								title: "骞抽《灞卞竞",
								districts: {
									410402: "鏂板崕鍖 ",
									410403: "鍗笢鍖 ",
									410404: "鐭抽緳鍖 ",
									410411: "婀涙渤鍖 ",
									410421: "瀹濅赴铡 ",
									410422: "鍙跺幕",
									410423: "椴佸北铡 ",
									410425: "閮忓幕",
									410481: "鑸为挗宁 ",
									410482: "姹濆窞宁 ",
									410483: "鍏跺畠鍖 "
								}
							},
							410500: {
								title: "瀹夐槼宁 ",
								districts: {
									410502: "鏂囧嘲鍖 ",
									410503: "鍖楀叧鍖 ",
									410505: "娈烽兘鍖 ",
									410506: "榫椤畨鍖 ",
									410522: "瀹夐槼铡 ",
									410523: "姹ら槾铡 ",
									410526: "婊戝幕",
									410527: "鍐呴粍铡 ",
									410581: "鏋楀窞宁 ",
									410582: "鍏跺畠鍖 "
								}
							},
							410600: {
								title: "楣ゅ宁 ",
								districts: {
									410602: "楣ゅ北鍖 ",
									410603: "灞卞煄鍖 ",
									410611: "娣囨花鍖 ",
									410621: "娴氩幕",
									410622: "娣囧幕",
									410623: "鍏跺畠鍖 "
								}
							},
							410700: {
								title: "鏂颁埂宁 ",
								districts: {
									410702: "绾㈡枣鍖 ",
									410703: "鍗花鍖  ",
									410704: "鍑ゆ硥鍖 ",
									410711: "鐗ч当鍖 ",
									410721: "鏂颁埂铡 ",
									410724: "銮峰槈铡 ",
									410725: "铡熼槼铡 ",
									410726: "寤舵触铡 ",
									410727: "灏佷笜铡 ",
									410728: "闀垮灒铡 ",
									410781: "鍗缘宁 ",
									410782: "杈夊幕宁 ",
									410783: "鍏跺畠鍖 "
								}
							},
							410800: {
								title: "鐒︿綔宁 ",
								districts: {
									410802: "瑙ｆ斁鍖 ",
									410803: "涓珯鍖 ",
									410804: "椹沩鍖 ",
									410811: "灞遍槼鍖 ",
									410821: "淇铡 ",
									410822: "鍗氱埍铡 ",
									410823: "姝﹂橱铡 ",
									410825: "娓╁幕",
									410882: "娌侀槼宁 ",
									410883: "瀛熷窞宁 ",
									410884: "鍏跺畠鍖 "
								}
							},
							410900: {
								title: "婵槼宁 ",
								districts: {
									410902: "鍗庨緳鍖 ",
									410922: "娓呬赴铡 ",
									410923: "鍗椾箰铡  ",
									410926: "锣冨幕",
									410927: "鍙板墠铡 ",
									410928: "婵槼铡 ",
									410929: "鍏跺畠鍖 "
								}
							},
							411000: {
								title: "璁告枪宁 ",
								districts: {
									411002: "榄忛兘鍖 ",
									411023: "璁告枪铡 ",
									411024: "閯㈤栎铡 ",
									411025: "瑗勫煄铡 ",
									411081: "绂瑰窞宁 ",
									411082: "闀胯忆宁 ",
									411083: "鍏跺畠鍖 "
								}
							},
							411100: {
								title: "婕渤宁  ",
								districts: {
									411102: "婧愭眹鍖 ",
									411103: "閮惧煄鍖 ",
									411104: "鍙栎鍖 ",
									411121: "鑸为槼铡 ",
									411122: "涓撮铡 ",
									411123: "鍏跺畠鍖 "
								}
							},
							411200: {
								title: "涓夐棬宄″竞",
								districts: {
									411202: "婀栨花鍖 ",
									411221: "娓戞睁铡 ",
									411222: "闄曞幕",
									411224: "鍗㈡皬铡 ",
									411281: "涔夐┈宁 ",
									411282: "鐏靛疂宁 ",
									411283: "鍏跺畠鍖  "
								}
							},
							411300: {
								title: "鍗楅槼宁 ",
								districts: {
									411302: "瀹涘煄鍖 ",
									411303: "鍗ч緳鍖 ",
									411321: "鍗楀雕铡 ",
									411322: "鏂瑰煄铡 ",
									411323: "瑗垮场铡 ",
									411324: "闀囧钩铡 ",
									411325: "鍐呬埂铡 ",
									411326: "娣呭窛铡 ",
									411327: "绀炬枣铡 ",
									411328: "鍞愭渤铡 ",
									411329: "鏂伴当铡 ",
									411330: "妗愭煆铡 ",
									411381: "闾揿窞宁 ",
									411382: "鍏跺畠鍖 "
								}
							},
							411400: {
								title: "鍟嗕笜宁 ",
								districts: {
									411402: "姊佸洯鍖 ",
									411403: "镌㈤槼鍖 ",
									411421: "姘戞潈铡 ",
									411422: "镌㈠幕",
									411423: "瀹侀栎铡 ",
									411424: "镆桦煄铡 ",
									411425: "铏炲煄铡 ",
									411426: "澶忛倯铡 ",
									411481: "姘稿煄宁 ",
									411482: "鍏跺畠鍖 "
								}
							},
							411500: {
								title: "淇￠槼宁 ",
								districts: {
									411502: "娴夋渤鍖 ",
									411503: "骞虫ˉ鍖 ",
									411521: "缃楀北铡 ",
									411522: "鍏夊北铡 ",
									411523: "鏂板幕",
									411524: "鍟嗗煄铡 ",
									411525: "锲哄铡 ",
									411526: "娼㈠窛铡 ",
									411527: "娣花铡 ",
									411528: "鎭幕",
									411529: "鍏跺畠鍖 "
								}
							},
							411600: {
								title: "锻ㄥ彛宁 ",
								districts: {
									411602: "宸濇眹鍖 ",
									411621: "镓舵矡铡 ",
									411622: "瑗垮崕铡 ",
									411623: "鍟嗘按铡 ",
									411624: "娌堜笜铡 ",
									411625: "閮稿煄铡 ",
									411626: "娣槼铡 ",
									411627: "澶悍铡 ",
									411628: "楣块倯铡 ",
									411681: "椤瑰煄宁 ",
									411682: "鍏跺畠鍖 "
								}
							},
							411700: {
								title: "椹婚┈搴楀竞",
								districts: {
									411702: "椹垮煄鍖 ",
									411721: "瑗垮钩铡 ",
									411722: "涓婅败铡 ",
									411723: "骞宠垎铡 ",
									411724: "姝ｉ槼铡 ",
									411725: "纭北铡 ",
									411726: "娉岄槼铡 ",
									411727: "姹濆崡铡 ",
									411728: "阆效钩铡 ",
									411729: "鏂拌败铡 ",
									411730: "鍏跺畠鍖 "
								}
							},
							410881: {
								title: "娴庢簮宁 ",
								districts: []
							}
						}
					},
					420000: {
						title: "婀栧宝鐪 ",
						cities: {
							420100: {
								title: "姝︽眽宁 ",
								districts: {
									420102: "姹熷哺鍖 ",
									420103: "姹熸眽鍖 ",
									420104: "纭氩彛鍖 ",
									420105: "姹夐槼鍖 ",
									420106: "姝︽枪鍖 ",
									420107: "闱掑北鍖 ",
									420111: "娲北鍖 ",
									420112: "涓滆タ婀栧尯",
									420113: "姹夊崡鍖 ",
									420114: "钄＄敻鍖 ",
									420115: "姹熷鍖 ",
									420116: "榛勯檪鍖 ",
									420117: "鏂版床鍖 ",
									420118: "鍏跺畠鍖 "
								}
							},
							420200: {
								title: "榛勭煶宁 ",
								districts: {
									420202: "榛勭煶娓尯",
									420203: "瑗垮灞卞尯",
									420204: "涓嬮檰鍖 ",
									420205: "阈佸北鍖 ",
									420222: "阒虫柊铡 ",
									420281: "澶у喍宁 ",
									420282: "鍏跺畠鍖 "
								}
							},
							420300: {
								title: "鍗佸牥宁 ",
								districts: {
									420302: "锣呯鍖 ",
									420303: "寮犳咕鍖 ",
									420321: "閮у幕",
									420322: "閮цタ铡 ",
									420323: "绔瑰北铡 ",
									420324: "绔规邯铡 ",
									420325: "鎴垮幕",
									420381: "涓规睙鍙ｅ竞",
									420382: "鍩庡尯",
									420383: "鍏跺畠鍖 "
								}
							},
							420500: {
								title: "瀹沧枪宁 ",
								districts: {
									420502: "瑗块栎鍖 ",
									420503: "浼嶅宀楀尯",
									420504: "镣瑰啖鍖 ",
									420505: "鐚囦涵鍖 ",
									420506: "澶烽栎鍖 ",
									420525: "杩滃畨铡 ",
									420526: "鍏村北铡 ",
									420527: "绉綊铡 ",
									420528: "闀块槼鍦熷镞忚嚜娌诲幕",
									420529: "浜斿嘲鍦熷镞忚嚜娌诲幕",
									420551: "钁涙床鍧濆尯",
									420552: "寮€鍙戝尯",
									420581: "瀹滈兘宁 ",
									420582: "褰挞槼宁 ",
									420583: "鏋濇睙宁 ",
									420584: "鍏跺畠鍖 "
								}
							},
							420600: {
								title: "瑗勯槼宁 ",
								districts: {
									420602: "瑗勫煄鍖 ",
									420606: "妯婂煄鍖 ",
									420607: "瑗勫窞鍖 ",
									420624: "鍗楁汲铡 ",
									420625: "璋峰煄铡 ",
									420626: "淇濆悍铡 ",
									420682: "钥佹渤鍙ｅ竞",
									420683: "鏋ｉ槼宁 ",
									420684: "瀹滃煄宁 ",
									420685: "鍏跺畠鍖 "
								}
							},
							420700: {
								title: "閯效窞宁 ",
								districts: {
									420702: "姊佸瓙婀栧尯",
									420703: "鍗庡鍖 ",
									420704: "閯效煄鍖 ",
									420705: "鍏跺畠鍖 "
								}
							},
							420800: {
								title: "钻嗛棬宁 ",
								districts: {
									420802: "涓滃疂鍖 ",
									420804: "鎺囧垁鍖 ",
									420821: "浜北铡  ",
									420822: "娌欐磱铡 ",
									420881: "阍熺ゥ宁 ",
									420882: "鍏跺畠鍖 "
								}
							},
							420900: {
								title: "瀛濇劅宁 ",
								districts: {
									420902: "瀛濆崡鍖 ",
									420921: "瀛濇枪铡 ",
									420922: "澶ф偀铡 ",
									420923: "浜戞ⅵ铡 ",
									420981: "搴斿煄宁 ",
									420982: "瀹夐檰宁 ",
									420984: "姹夊窛宁 ",
									420985: "鍏跺畠鍖 "
								}
							},
							421000: {
								title: "钻嗗窞宁 ",
								districts: {
									421002: "娌椤竞鍖 ",
									421003: "钻嗗窞鍖 ",
									421022: "鍏畨铡 ",
									421023: "鐩戝埄铡 ",
									421024: "姹熼栎铡 ",
									421081: "鐭抽宁 ",
									421083: "娲箹宁 ",
									421087: "鏉炬粙宁 ",
									421088: "鍏跺畠鍖 "
								}
							},
							421100: {
								title: "榛勫念宁 ",
								districts: {
									421102: "榛勫窞鍖 ",
									421121: "锲㈤铡 ",
									421122: "绾㈠畨铡 ",
									421123: "缃楃敯铡 ",
									421124: "鑻卞北铡 ",
									421125: "娴犳按铡 ",
									421126: "钑叉槬铡 ",
									421127: "榛勬铡 ",
									421181: "楹诲煄宁 ",
									421182: "姝︾┐宁 ",
									421183: "鍏跺畠鍖 "
								}
							},
							421200: {
								title: "鍜稿畞宁 ",
								districts: {
									421202: "鍜稿畨鍖 ",
									421221: "鍢夐奔铡 ",
									421222: "阃氩煄铡 ",
									421223: "宕回槼铡 ",
									421224: "阃氩北铡 ",
									421281: "璧ゅ宁 ",
									421282: "娓╂硥鍩庡尯",
									421283: "鍏跺畠鍖 "
								}
							},
							421300: {
								title: "闅忓窞宁 ",
								districts: {
									421302: "旋鹃兘鍖 ",
									421321: "闅忓幕",
									421381: "骞挎按宁 ",
									421382: "鍏跺畠鍖 "
								}
							},
							422800: {
								title: "鎭╂柦鍦熷镞忚嫍镞忚嚜娌诲窞",
								districts: {
									422801: "鎭╂柦宁 ",
									422802: "鍒╁窛宁 ",
									422822: "寤哄铡 ",
									422823: "宸翠笢铡 ",
									422825: "瀹ｆ仼铡 ",
									422826: "鍜镐赴铡 ",
									422827: "鏉ュ嚖铡 ",
									422828: "楣ゅ嘲铡 ",
									422829: "鍏跺畠鍖 "
								}
							},
							429004: {
								title: "浠欐宁 ",
								districts: []
							},
							429005: {
								title: "娼沧睙宁 ",
								districts: []
							},
							429006: {
								title: "澶╅棬宁 ",
								districts: []
							},
							429021: {
								title: "绁炲啘鏋舵滠鍖 ",
								districts: []
							}
						}
					},
					430000: {
						title: "婀栧崡鐪 ",
						cities: {
							430100: {
								title: "闀挎瞰宁 ",
								districts: {
									430102: "鑺栾搲鍖 ",
									430103: "澶╁绩鍖 ",
									430104: "宀抽簱鍖 ",
									430105: "寮€绂忓尯",
									430111: "板ㄨ姳鍖 ",
									430121: "闀挎瞰铡 ",
									430122: "链涘煄铡 ",
									430124: "瀹佷埂铡 ",
									430181: "娴忛槼宁 ",
									430182: "鍏跺畠鍖 "
								}
							},
							430200: {
								title: "镙床宁 ",
								districts: {
									430202: "钻峰鍖 ",
									430203: "鑺︽窞鍖 ",
									430204: "鐭冲嘲鍖 ",
									430211: "澶╁崖鍖 ",
									430221: "镙床铡 ",
									430223: "鏀稿幕",
									430224: "锣堕栎铡 ",
									430225: "镣庨栎铡 ",
									430281: "阅撮栎宁 ",
									430282: "鍏跺畠鍖 "
								}
							},
							430300: {
								title: "婀樻江宁 ",
								districts: {
									430302: "板ㄦ箹鍖  ",
									430304: "宀冲鍖 ",
									430321: "婀樻江铡 ",
									430381: "婀树埂宁 ",
									430382: "阔跺北宁 ",
									430383: "鍏跺畠鍖  "
								}
							},
							430400: {
								title: "琛￠槼宁 ",
								districts: {
									430405: "鐝犳櫀鍖 ",
									430406: "板佸嘲鍖 ",
									430407: "鐭抽紦鍖 ",
									430408: "钂告箻鍖 ",
									430412: "鍗楀渤鍖 ",
									430421: "琛￠槼铡 ",
									430422: "琛″崡铡 ",
									430423: "琛″北铡 ",
									430424: "琛′笢铡 ",
									430426: "绁佷笢铡 ",
									430481: "钥掗槼宁 ",
									430482: "宁稿畞宁 ",
									430483: "鍏跺畠鍖 "
								}
							},
							430500: {
								title: "闾甸槼宁 ",
								districts: {
									430502: "鍙屾竻鍖 ",
									430503: "澶хゥ鍖 ",
									430511: "鍖楀鍖 ",
									430521: "闾典笢铡 ",
									430522: "鏂伴偟铡 ",
									430523: "闾甸槼铡 ",
									430524: "闅嗗洖铡 ",
									430525: "娲炲彛铡 ",
									430527: "缁ュ畞铡 ",
									430528: "鏂板畞铡 ",
									430529: "鍩庢鑻楁棌镊不铡 ",
									430581: "姝﹀念宁 ",
									430582: "鍏跺畠鍖 "
								}
							},
							430600: {
								title: "宀抽槼宁 ",
								districts: {
									430602: "宀抽槼妤煎尯",
									430603: "浜戞邯鍖  ",
									430611: "钖涘北鍖 ",
									430621: "宀抽槼铡 ",
									430623: "鍗庡铡 ",
									430624: "婀橀槾铡 ",
									430626: "骞虫睙铡 ",
									430681: "姹ㄧ绥宁 ",
									430682: "涓存箻宁 ",
									430683: "鍏跺畠鍖 "
								}
							},
							430700: {
								title: "宁稿痉宁  ",
								districts: {
									430702: "姝﹂栎鍖 ",
									430703: "榧庡煄鍖 ",
									430721: "瀹変埂铡 ",
									430722: "姹夊铡 ",
									430723: "婢у幕",
									430724: "涓存晶铡 ",
									430725: "妗冩簮铡 ",
									430726: "鐭抽棬铡 ",
									430781: "娲ュ竞宁 ",
									430782: "鍏跺畠鍖  "
								}
							},
							430800: {
								title: "寮犲鐣屽竞",
								districts: {
									430802: "姘稿畾鍖 ",
									430811: "姝﹂栎婧愬尯",
									430821: "鎱埚埄铡  ",
									430822: "妗戞铡 ",
									430823: "鍏跺畠鍖 "
								}
							},
							430900: {
								title: "鐩婇槼宁 ",
								districts: {
									430902: "璧勯槼鍖 ",
									430903: "璧北鍖 ",
									430921: "鍗楀幕",
									430922: "妗冩睙铡 ",
									430923: "瀹夊寲铡 ",
									430981: "娌呮睙宁 ",
									430982: "鍏跺畠鍖 "
								}
							},
							431000: {
								title: "閮村窞宁 ",
								districts: {
									431002: "鍖楁箹鍖 ",
									431003: "鑻忎粰鍖 ",
									431021: "妗傞槼铡 ",
									431022: "瀹灭珷铡 ",
									431023: "姘稿叴铡 ",
									431024: "鍢夌铡 ",
									431025: "涓存铡 ",
									431026: "姹濆煄铡 ",
									431027: "妗備笢铡 ",
									431028: "瀹変粊铡 ",
									431081: "璧勫叴宁 ",
									431082: "鍏跺畠鍖 "
								}
							},
							431100: {
								title: "姘稿窞宁 ",
								districts: {
									431102: "板堕栎鍖 ",
									431103: "鍐锋按婊╁尯",
									431121: "绁侀槼铡 ",
									431122: "涓滃畨铡 ",
									431123: "鍙岀硗铡 ",
									431124: "阆揿幕",
									431125: "姹熸案铡 ",
									431126: "瀹佽翻铡 ",
									431127: "钃濆北铡 ",
									431128: "鏂扮敯铡 ",
									431129: "姹熷崕鐟舵棌镊不铡 ",
									431130: "鍏跺畠鍖 "
								}
							},
							431200: {
								title: "镐€鍖栧竞",
								districts: {
									431202: "楣ゅ煄鍖 ",
									431221: "涓楠铡 ",
									431222: "娌呴栎铡 ",
									431223: "杈版邯铡 ",
									431224: "婧嗘郸铡 ",
									431225: "浼氩悓铡 ",
									431226: "楹婚槼鑻楁棌镊不铡 ",
									431227: "鏂版檭渚楁棌镊不铡 ",
									431228: "鑺锋睙渚楁棌镊不铡 ",
									431229: "闱栧窞鑻楁棌渚楁棌镊不铡 ",
									431230: "阃氶亡渚楁棌镊不铡 ",
									431281: "娲睙宁 ",
									431282: "鍏跺畠鍖 "
								}
							},
							431300: {
								title: "濞勫簳宁 ",
								districts: {
									431302: "濞勬槦鍖 ",
									431321: "鍙屽嘲铡 ",
									431322: "鏂板寲铡 ",
									431381: "鍐锋按姹熷竞",
									431382: "娑熸簮宁  ",
									431383: "鍏跺畠鍖 "
								}
							},
							433100: {
								title: "婀樿タ鍦熷镞忚嫍镞忚嚜娌诲窞",
								districts: {
									433101: "钖夐宁 ",
									433122: "娉告邯铡 ",
									433123: "鍑ゅ嚢铡 ",
									433124: "鑺卞灒铡 ",
									433125: "淇濋潠铡 ",
									433126: "鍙や笀铡 ",
									433127: "姘搁『铡 ",
									433130: "榫椤北铡 ",
									433131: "鍏跺畠鍖 "
								}
							}
						}
					},
					440000: {
						title: "骞夸笢鐪 ",
						cities: {
							440100: {
								title: "骞垮窞宁 ",
								districts: {
									440103: "钻旀咕鍖 ",
									440104: "瓒婄鍖 ",
									440105: "娴风彔鍖 ",
									440106: "澶╂渤鍖 ",
									440111: "锏戒簯鍖 ",
									440112: "榛勫煍鍖 ",
									440113: "鐣鍖 ",
									440114: "鑺遍兘鍖 ",
									440115: "鍗楁瞰鍖 ",
									440116: "钀濆矖鍖 ",
									440183: "澧炲煄宁 ",
									440184: "浠庡寲宁 ",
									440188: "涓滃北鍖 ",
									440189: "鍏跺畠鍖 "
								}
							},
							440200: {
								title: "阔跺叧宁  ",
								districts: {
									440203: "姝︽睙鍖 ",
									440204: "娴堟睙鍖 ",
									440205: "旋叉睙鍖 ",
									440222: "濮嫔叴铡 ",
									440224: "浠佸寲铡 ",
									440229: "缈佹簮铡 ",
									440232: "涔虫簮鐟舵棌镊不铡 ",
									440233: "鏂颁赴铡 ",
									440281: "涔愭枪宁  ",
									440282: "鍗楅泟宁 ",
									440283: "鍏跺畠鍖 "
								}
							},
							440300: {
								title: "娣卞湷宁 ",
								districts: {
									440303: "缃楁箹鍖 ",
									440304: "绂忕敯鍖 ",
									440305: "鍗楀北鍖 ",
									440306: "瀹濆畨鍖 ",
									440307: "榫椤矖鍖 ",
									440308: "鐩愮敯鍖 ",
									440309: "鍏跺畠鍖 "
								}
							},
							440400: {
								title: "鐝犳捣宁 ",
								districts: {
									440402: "棣欐床鍖 ",
									440403: "鏂楅棬鍖 ",
									440404: "阅戞咕鍖 ",
									440486: "阅戝攼鍖 ",
									440487: "鍗楁咕鍖 ",
									440488: "鍏跺畠鍖 "
								}
							},
							440500: {
								title: "姹曞ご宁 ",
								districts: {
									440507: "榫欐箹鍖 ",
									440511: "阅戝钩鍖 ",
									440512: "婵犳睙鍖 ",
									440513: "娼槼鍖 ",
									440514: "娼崡鍖 ",
									440515: "婢勬捣鍖 ",
									440523: "鍗楁境铡 ",
									440524: "鍏跺畠鍖 "
								}
							},
							440600: {
								title: "浣涘北宁  ",
								districts: {
									440604: "绂呭煄鍖 ",
									440605: "鍗楁捣鍖 ",
									440606: "椤哄痉鍖 ",
									440607: "涓夋按鍖 ",
									440608: "楂樻槑鍖 ",
									440609: "鍏跺畠鍖 "
								}
							},
							440700: {
								title: "姹熼棬宁 ",
								districts: {
									440703: "钃睙鍖 ",
									440704: "姹熸捣鍖 ",
									440705: "鏂颁细鍖 ",
									440781: "鍙板北宁 ",
									440783: "寮€骞冲竞",
									440784: "楣ゅ北宁 ",
									440785: "鎭╁钩宁 ",
									440786: "鍏跺畠鍖 "
								}
							},
							440800: {
								title: "婀涙睙宁 ",
								districts: {
									440802: "璧ゅ潕鍖 ",
									440803: "暗炲北鍖 ",
									440804: "鍧″ご鍖 ",
									440811: "楹荤珷鍖 ",
									440823: "阆傛邯铡 ",
									440825: "寰愰椈铡 ",
									440881: "寤夋睙宁 ",
									440882: "板峰窞宁 ",
									440883: "钖村窛宁 ",
									440884: "鍏跺畠鍖 "
								}
							},
							440900: {
								title: "锣效悕宁 ",
								districts: {
									440902: "锣效崡鍖 ",
									440903: "锣傛腐鍖 ",
									440923: "鐢电槠铡 ",
									440981: "楂桦窞宁 ",
									440982: "鍖栧窞宁 ",
									440983: "淇″疁宁 ",
									440984: "鍏跺畠鍖 "
								}
							},
							441200: {
								title: "镶囧简宁 ",
								districts: {
									441202: "绔窞鍖 ",
									441203: "榧庢箹鍖 ",
									441223: "骞垮畞铡 ",
									441224: "镐€板嗗幕",
									441225: "灏佸紑铡 ",
									441226: "寰峰简铡 ",
									441283: "楂樿宁 ",
									441284: "锲涗细宁 ",
									441285: "鍏跺畠鍖 "
								}
							},
							441300: {
								title: "鎯犲窞宁 ",
								districts: {
									441302: "鎯犲煄鍖 ",
									441303: "鎯犻槼鍖 ",
									441322: "鍗氱绥铡 ",
									441323: "鎯犱笢铡 ",
									441324: "榫欓棬铡 ",
									441325: "鍏跺畠鍖 "
								}
							},
							441400: {
								title: "姊呭窞宁 ",
								districts: {
									441402: "姊呮睙鍖 ",
									441421: "姊呭幕",
									441422: "澶у煍铡 ",
									441423: "涓伴『铡 ",
									441424: "浜斿崕铡 ",
									441426: "骞宠翻铡 ",
									441427: "钑夊箔铡 ",
									441481: "鍏村畞宁 ",
									441482: "鍏跺畠鍖 "
								}
							},
							441500: {
								title: "姹曞熬宁 ",
								districts: {
									441502: "鍩庡尯",
									441521: "娴蜂赴铡 ",
									441523: "闄嗘渤铡 ",
									441581: "闄嗕赴宁 ",
									441582: "鍏跺畠鍖 "
								}
							},
							441600: {
								title: "娌虫簮宁 ",
								districts: {
									441602: "婧愬煄鍖 ",
									441621: "绱噾铡 ",
									441622: "榫椤窛铡 ",
									441623: "杩炲钩铡 ",
									441624: "鍜屽钩铡 ",
									441625: "涓沧簮铡 ",
									441626: "鍏跺畠鍖 "
								}
							},
							441700: {
								title: "阒虫睙宁 ",
								districts: {
									441702: "姹熷煄鍖 ",
									441721: "阒宠タ铡 ",
									441723: "阒充笢铡 ",
									441781: "阒虫槬宁 ",
									441782: "鍏跺畠鍖 "
								}
							},
							441800: {
								title: "娓呰翻宁 ",
								districts: {
									441802: "娓呭煄鍖 ",
									441821: "浣涘念铡 ",
									441823: "阒冲北铡 ",
									441825: "杩炲北澹棌鐟舵棌镊不铡 ",
									441826: "杩炲崡鐟舵棌镊不铡 ",
									441827: "娓呮柊铡 ",
									441881: "鑻卞痉宁 ",
									441882: "杩炲窞宁 ",
									441883: "鍏跺畠鍖 "
								}
							},
							441900: {
								title: "涓滆帪宁 ",
								districts: {
									441901: "銮炲煄鍖 ",
									441902: "鍗楀煄鍖 ",
									441903: "涓滃煄鍖 ",
									441904: "涓囨睙鍖 ",
									441905: "鐭崇ⅲ闀 ",
									441906: "铏庨棬闀 "
								}
							},
							442000: {
								title: "涓北宁 ",
								districts: {
									442001: "鐭冲矏鍖 ",
									442002: "涓滃尯",
									442003: "瑗垮尯",
									442004: "鍗楀尯",
									442005: "浜旀灞卞尯",
									442006: "涓北鐏偓楂樻妧链骇涓氩紑鍙戝尯",
									442007: "榛勫渻闀  ",
									442008: "鍗楀ご闀 ",
									442009: "涓滃嚖闀 ",
									442010: "阒沧瞰闀 ",
									442011: "灏忔闀 ",
									442012: "涓滃崌闀  ",
									442013: "鍙ら晣闀 ",
									442014: "妯爮闀 ",
									442016: "涓夎闀 ",
									442017: "姘戜紬闀 ",
									442018: "鍗楁湕闀 ",
									442019: "娓彛闀 ",
									442020: "澶ф秾闀 ",
									442021: "娌欐邯闀 ",
									442022: "涓変埂闀 ",
									442023: "鏉胯姗闀 ",
									442024: "绁炴咕闀 ",
									442025: "鍧︽床闀 "
								}
							},
							445100: {
								title: "娼窞宁 ",
								districts: {
									445102: "婀樻ˉ鍖 ",
									445121: "娼畨铡 ",
									445122: "楗跺钩铡 ",
									445185: "鏋邯鍖 ",
									445186: "鍏跺畠鍖 "
								}
							},
							445200: {
								title: "鎻槼宁 ",
								districts: {
									445202: "姒曞煄鍖 ",
									445221: "鎻笢铡 ",
									445222: "鎻タ铡 ",
									445224: "鎯犳潵铡 ",
									445281: "鏅畞宁 ",
									445284: "涓滃北鍖 ",
									445285: "鍏跺畠鍖 "
								}
							},
							445300: {
								title: "浜戞诞宁 ",
								districts: {
									445302: "浜戝煄鍖  ",
									445321: "鏂板叴铡 ",
									445322: "閮佸崡铡 ",
									445323: "浜戝畨铡 ",
									445381: "缃楀畾宁 ",
									445382: "鍏跺畠鍖 "
								}
							}
						}
					},
					450000: {
						title: "骞胯タ澹棌镊不鍖 ",
						cities: {
							450100: {
								title: "鍗楀畞宁 ",
								districts: {
									450102: "鍏村畞鍖 ",
									450103: "闱掔鍖 ",
									450105: "姹熷崡鍖 ",
									450107: "瑗夸埂濉桦尯",
									450108: "鑹简鍖 ",
									450109: "闾曞畞鍖 ",
									450122: "姝﹂福铡 ",
									450123: "闅嗗畨铡 ",
									450124: "椹北铡 ",
									450125: "涓婃滠铡 ",
									450126: "瀹鹃槼铡 ",
									450127: "妯幕",
									450128: "鍏跺畠鍖 "
								}
							},
							450200: {
								title: "镆冲窞宁 ",
								districts: {
									450202: "鍩庝腑鍖 ",
									450203: "楸煎嘲鍖 ",
									450204: "镆冲崡鍖 ",
									450205: "镆冲宝鍖 ",
									450221: "镆虫睙铡 ",
									450222: "镆冲煄铡 ",
									450223: "楣垮铡 ",
									450224: "铻嶅畨铡 ",
									450225: "铻嶆按鑻楁棌镊不铡 ",
									450226: "涓夋睙渚楁棌镊不铡 ",
									450227: "鍏跺畠鍖 "
								}
							},
							450300: {
								title: "妗傛滠宁 ",
								districts: {
									450302: "绉€宄板尯",
									450303: "鍙犲僵鍖 ",
									450304: "璞″北鍖 ",
									450305: "涓冩槦鍖 ",
									450311: "板佸北鍖 ",
									450321: "阒虫湐铡 ",
									450322: "涓存铡 ",
									450323: "鐏靛窛铡 ",
									450324: "鍏ㄥ窞铡 ",
									450325: "鍏村畨铡 ",
									450326: "姘哥铡 ",
									450327: "鐏岄槼铡 ",
									450328: "榫栾儨钖勬棌镊不铡 ",
									450329: "璧勬簮铡 ",
									450330: "骞充箰铡 ",
									450331: "钻旀郸铡  ",
									450332: "鎭煄鐟舵棌镊不铡 ",
									450333: "鍏跺畠鍖 "
								}
							},
							450400: {
								title: "姊у窞宁 ",
								districts: {
									450403: "涓囩鍖 ",
									450404: "铦跺北鍖 ",
									450405: "闀挎床鍖 ",
									450421: "鑻嶆ⅶ铡 ",
									450422: "钘ゅ幕",
									450423: "钂椤北铡 ",
									450481: "宀戞邯宁 ",
									450482: "鍏跺畠鍖 "
								}
							},
							450500: {
								title: "鍖楁捣宁 ",
								districts: {
									450502: "娴峰煄鍖  ",
									450503: "阈舵捣鍖 ",
									450512: "阈佸北娓尯",
									450521: "钖堟郸铡 ",
									450522: "鍏跺畠鍖 "
								}
							},
							450600: {
								title: "阒插煄娓竞",
								districts: {
									450602: "娓彛鍖 ",
									450603: "阒插煄鍖 ",
									450621: "涓婃€濆幕",
									450681: "涓滃叴宁 ",
									450682: "鍏跺畠鍖 "
								}
							},
							450700: {
								title: "阍﹀窞宁 ",
								districts: {
									450702: "阍﹀崡鍖 ",
									450703: "阍﹀宝鍖 ",
									450721: "鐏靛北铡 ",
									450722: "娴﹀宝铡 ",
									450723: "鍏跺畠鍖 "
								}
							},
							450800: {
								title: "璐垫腐宁 ",
								districts: {
									450802: "娓宝鍖 ",
									450803: "娓崡鍖 ",
									450804: "瑕冨鍖 ",
									450821: "骞冲崡铡 ",
									450881: "妗效钩宁 ",
									450882: "鍏跺畠鍖 "
								}
							},
							450900: {
								title: "鐜夋滠宁 ",
								districts: {
									450902: "鐜夊窞鍖 ",
									450921: "瀹瑰幕",
									450922: "闄嗗窛铡  ",
									450923: "鍗氱槠铡 ",
									450924: "鍏翠笟铡 ",
									450981: "鍖楁祦宁 ",
									450982: "鍏跺畠鍖 "
								}
							},
							451000: {
								title: "锏捐壊宁 ",
								districts: {
									451002: "鍙虫睙鍖 ",
									451021: "鐢伴槼铡 ",
									451022: "鐢颁笢铡 ",
									451023: "骞虫灉铡 ",
									451024: "寰蜂缭铡 ",
									451025: "闱栬タ铡 ",
									451026: "闾ｅ浔铡 ",
									451027: "鍑屼簯铡 ",
									451028: "涔愪笟铡 ",
									451029: "鐢版滠铡 ",
									451030: "瑗挎滠铡 ",
									451031: "闅嗘滠钖勬棌镊不铡 ",
									451032: "鍏跺畠鍖 "
								}
							},
							451100: {
								title: "璐哄窞宁 ",
								districts: {
									451102: "鍏鍖 ",
									451121: "鏄钩铡 ",
									451122: "阍熷北铡  ",
									451123: "瀵屽窛鐟舵棌镊不铡 ",
									451124: "鍏跺畠鍖 "
								}
							},
							451200: {
								title: "娌虫睁宁 ",
								districts: {
									451202: "阅戝煄姹熷尯",
									451221: "鍗椾腹铡 ",
									451222: "澶╁敞铡 ",
									451223: "鍑ゅ北铡 ",
									451224: "涓滃叞铡 ",
									451225: "缃楀煄浠浆镞忚嚜娌诲幕",
									451226: "鐜睙姣涘崡镞忚嚜娌诲幕",
									451227: "宸撮┈鐟舵棌镊不铡 ",
									451228: "閮借畨鐟舵棌镊不铡 ",
									451229: "澶у寲鐟舵棌镊不铡 ",
									451281: "瀹滃窞宁 ",
									451282: "鍏跺畠鍖 "
								}
							},
							451300: {
								title: "鏉ュ宁 ",
								districts: {
									451302: "鍏村鍖 ",
									451321: "蹇诲煄铡 ",
									451322: "璞″窞铡 ",
									451323: "姝﹀铡 ",
									451324: "阅戠鐟舵棌镊不铡 ",
									451381: "钖埚北宁 ",
									451382: "鍏跺畠鍖 "
								}
							},
							451400: {
								title: "宕囧乏宁 ",
								districts: {
									451402: "姹熷窞鍖  ",
									451421: "镓剁互铡 ",
									451422: "瀹佹槑铡 ",
									451423: "榫椤窞铡 ",
									451424: "澶ф柊铡 ",
									451425: "澶╃瓑铡  ",
									451481: "鍑ゥ宁 ",
									451482: "鍏跺畠鍖 "
								}
							}
						}
					},
					460000: {
						title: "娴峰崡鐪 ",
						cities: {
							460100: {
								title: "娴峰彛宁 ",
								districts: {
									460105: "绉€鑻卞尯",
									460106: "榫椤崕鍖 ",
									460107: "鐞煎北鍖 ",
									460108: "缇庡叞鍖 ",
									460109: "鍏跺畠鍖 "
								}
							},
							460200: {
								title: "涓変筜宁 ",
								districts: {
									406201: "钖夐槼鍖 ",
									406202: "澶╂动鍖 ",
									406203: "娴锋鍖 ",
									406204: "宕栧窞鍖 "
								}
							},
							469001: {
								title: "浜旀寚灞卞竞",
								districts: []
							},
							469002: {
								title: "鐞兼捣宁 ",
								districts: []
							},
							469003: {
								title: "鍎嫔窞宁 ",
								districts: []
							},
							469005: {
								title: "鏂囨枪宁 ",
								districts: []
							},
							469006: {
								title: "涓囧畞宁 ",
								districts: []
							},
							469007: {
								title: "涓沧楠宁 ",
								districts: []
							},
							469025: {
								title: "瀹氩畨铡 ",
								districts: []
							},
							469026: {
								title: "灞枪铡 ",
								districts: []
							},
							469027: {
								title: "婢勮繄铡 ",
								districts: []
							},
							469028: {
								title: "涓撮珮铡  ",
								districts: []
							},
							469030: {
								title: "锏芥瞰榛庢棌镊不铡 ",
								districts: []
							},
							469031: {
								title: "鏄屾睙榛庢棌镊不铡  ",
								districts: []
							},
							469033: {
								title: "涔愪笢榛庢棌镊不铡 ",
								districts: []
							},
							469034: {
								title: "闄垫按榛庢棌镊不铡  ",
								districts: []
							},
							469035: {
								title: "淇濅涵榛庢棌鑻楁棌镊不铡 ",
								districts: []
							},
							469036: {
								title: "鐞间腑榛庢棌鑻楁棌镊不铡 ",
								districts: []
							},
							469037: {
								title: "瑗挎瞰缇ゅ矝",
								districts: []
							},
							469038: {
								title: "鍗楁瞰缇ゅ矝",
								districts: []
							},
							469039: {
								title: "涓瞰缇ゅ矝镄勫矝绀佸强鍏舵捣鍩 ",
								districts: []
							}
						}
					},
					500000: {
						title: "阅嶅简",
						cities: {
							500100: {
								title: "阅嶅简宁 ",
								districts: {
									500101: "涓囧窞鍖 ",
									500102: "娑栎鍖 ",
									500103: "娓濅腑鍖 ",
									500104: "澶ф浮鍙ｅ尯",
									500105: "姹熷宝鍖 ",
									500106: "娌椤潽鍧濆尯",
									500107: "涔濋緳鍧″尯",
									500108: "鍗楀哺鍖 ",
									500109: "鍖楃鍖 ",
									500110: "涓囩洓鍖 ",
									500111: "鍙屾ˉ鍖 ",
									500112: "娓濆宝鍖  ",
									500113: "宸村崡鍖 ",
									500114: "榛旀睙鍖 ",
									500115: "闀垮鍖 ",
									500222: "缍︽睙铡 ",
									500223: "娼煎崡铡  ",
									500224: "阈沧铡 ",
									500225: "澶ц冻铡 ",
									500226: "钻ｆ枪铡 ",
									500227: "鐠у北铡 ",
									500228: "姊佸钩铡  ",
									500229: "鍩庡彛铡 ",
									500230: "涓伴兘铡 ",
									500231: "鍨睙铡 ",
									500232: "姝﹂殕铡 ",
									500233: "蹇犲幕",
									500234: "寮€铡 ",
									500235: "浜戦槼铡 ",
									500236: "濂夎妭铡 ",
									500237: "宸北铡 ",
									500238: "宸邯铡 ",
									500240: "鐭虫煴鍦熷镞忚嚜娌诲幕",
									500241: "绉€灞卞湡瀹舵棌鑻楁棌镊不铡 ",
									500242: "閰夐槼鍦熷镞忚嫍镞忚嚜娌诲幕",
									500243: "褰按鑻楁棌鍦熷镞忚嚜娌诲幕",
									500381: "姹熸触鍖 ",
									500382: "钖埚窛鍖 ",
									500383: "姘稿窛鍖 ",
									500384: "鍗楀窛鍖 ",
									500385: "鍏跺畠鍖 "
								}
							}
						}
					},
					510000: {
						title: "锲涘窛鐪 ",
						cities: {
							510100: {
								title: "鎴愰兘宁 ",
								districts: {
									510103: "楂樻柊鍖 ",
									510104: "阌︽睙鍖 ",
									510105: "闱掔緤鍖 ",
									510106: "阅戠坛鍖 ",
									510107: "姝︿警鍖 ",
									510108: "鎴愬崕鍖 ",
									510112: "榫欐硥椹垮尯",
									510113: "闱掔槠姹熷尯",
									510114: "鏂伴兘鍖 ",
									510115: "娓╂睙鍖 ",
									510121: "阅戝爞铡 ",
									510122: "鍙屾祦铡 ",
									510124: "閮幕",
									510129: "澶ч倯铡 ",
									510131: "钂叉睙铡 ",
									510132: "鏂版触铡 ",
									510181: "閮芥睙鍫板竞",
									510182: "褰窞宁 ",
									510183: "闾涘碛宁 ",
									510184: "宕囧窞宁 ",
									510185: "鍏跺畠鍖 "
								}
							},
							510300: {
								title: "镊础宁 ",
								districts: {
									510302: "镊祦浜曞尯",
									510303: "璐′簳鍖 ",
									510304: "澶у畨鍖 ",
									510311: "娌挎哗鍖 ",
									510321: "钻ｅ幕",
									510322: "瀵岄『铡 ",
									510323: "鍏跺畠鍖 "
								}
							},
							510400: {
								title: "鏀€鏋濊姳宁 ",
								districts: {
									510402: "涓滃尯",
									510403: "瑗垮尯",
									510411: "浠佸拰鍖 ",
									510421: "绫虫槗铡 ",
									510422: "鐩愯竟铡 ",
									510423: "鍏跺畠鍖 "
								}
							},
							510500: {
								title: "娉稿窞宁 ",
								districts: {
									510502: "姹熼槼鍖 ",
									510503: "绾虫邯鍖 ",
									510504: "榫欓┈娼尯",
									510521: "娉稿幕",
									510522: "钖堟睙铡 ",
									510524: "鍙欐案铡 ",
									510525: "鍙よ敽铡 ",
									510526: "鍏跺畠鍖 "
								}
							},
							510600: {
								title: "寰烽槼宁 ",
								districts: {
									510603: "镞岄槼鍖 ",
									510623: "涓睙铡 ",
									510626: "缃楁睙铡 ",
									510681: "骞挎眽宁 ",
									510682: "浠€闾″竞",
									510683: "缁电宁 ",
									510684: "鍏跺畠鍖 "
								}
							},
							510700: {
								title: "缁甸槼宁 ",
								districts: {
									510703: "娑煄鍖 ",
									510704: "娓镐粰鍖 ",
									510722: "涓夊彴铡 ",
									510723: "鐩愪涵铡 ",
									510724: "瀹夊幕",
									510725: "姊撴郊铡  ",
									510726: "鍖楀窛缇屾棌镊不铡 ",
									510727: "骞虫铡 ",
									510751: "楂樻柊鍖 ",
									510781: "姹熸补宁 ",
									510782: "鍏跺畠鍖 "
								}
							},
							510800: {
								title: "骞垮崖宁 ",
								districts: {
									510802: "鍒╁窞鍖 ",
									510811: "鍏冨潩鍖 ",
									510812: "链濆ぉ鍖 ",
									510821: "镞鸿愧铡 ",
									510822: "闱掑窛铡 ",
									510823: "鍓戦桤铡 ",
									510824: "鑻嶆邯铡 ",
									510825: "鍏跺畠鍖 "
								}
							},
							510900: {
								title: "阆效畞宁 ",
								districts: {
									510903: "鑸瑰北鍖 ",
									510904: "瀹夊眳鍖 ",
									510921: "钃邯铡 ",
									510922: "灏勬椽铡 ",
									510923: "澶ц嫳铡 ",
									510924: "鍏跺畠鍖 "
								}
							},
							511000: {
								title: "鍐呮睙宁 ",
								districts: {
									511002: "宁备腑鍖 ",
									511011: "涓滃叴鍖 ",
									511024: "濞佽翻铡 ",
									511025: "璧勪腑铡 ",
									511028: "闅嗘枪铡  ",
									511029: "鍏跺畠鍖 "
								}
							},
							511100: {
								title: "涔愬北宁 ",
								districts: {
									511102: "宁备腑鍖 ",
									511111: "娌欐咕鍖 ",
									511112: "浜旈€氭ˉ鍖 ",
									511113: "阅戝彛娌冲尯",
									511123: "钟崭负铡 ",
									511124: "浜旷爷铡 ",
									511126: "澶规睙铡 ",
									511129: "娌愬窛铡 ",
									511132: "宄ㄨ竟褰濇棌镊不铡 ",
									511133: "椹竟褰濇棌镊不铡 ",
									511181: "宄ㄧ湁灞卞竞",
									511182: "鍏跺畠鍖 "
								}
							},
							511300: {
								title: "鍗楀庞宁 ",
								districts: {
									511302: "椤哄简鍖 ",
									511303: "楂桦潽鍖 ",
									511304: "鍢夐栎鍖 ",
									511321: "鍗楅儴铡 ",
									511322: "钀ュ北铡 ",
									511323: "钃畨铡 ",
									511324: "浠檱铡 ",
									511325: "瑗垮庞铡 ",
									511381: "阒嗕腑宁 ",
									511382: "鍏跺畠鍖 "
								}
							},
							511400: {
								title: "鐪夊北宁 ",
								districts: {
									511402: "涓滃浔鍖 ",
									511421: "浠佸铡 ",
									511422: "褰北铡 ",
									511423: "娲泤铡 ",
									511424: "涓规１铡  ",
									511425: "闱掔铡 ",
									511426: "鍏跺畠鍖 "
								}
							},
							511500: {
								title: "瀹滃宁 ",
								districts: {
									511502: "缈犲睆鍖 ",
									511521: "瀹滃铡 ",
									511522: "鍗楁邯铡 ",
									511523: "姹熷畨铡 ",
									511524: "闀垮畞铡 ",
									511525: "楂桦幕",
									511526: "鐝椤幕",
									511527: "绛犺繛铡 ",
									511528: "鍏存枃铡 ",
									511529: "灞忓北铡 ",
									511530: "鍏跺畠鍖 "
								}
							},
							511600: {
								title: "骞垮畨宁 ",
								districts: {
									511602: "骞垮畨鍖 ",
									511621: "宀虫睁铡 ",
									511622: "姝﹁儨铡 ",
									511623: "闾绘按铡 ",
									511681: "鍗庤掼宁 ",
									511682: "宁傝緰鍖 ",
									511683: "鍏跺畠鍖 "
								}
							},
							511700: {
								title: "杈惧窞宁 ",
								districts: {
									511702: "阃氩窛鍖 ",
									511721: "杈惧幕",
									511722: "瀹ｆ眽铡 ",
									511723: "寮€姹熷幕",
									511724: "澶х铡 ",
									511725: "娓犲幕",
									511781: "涓囨簮宁 ",
									511782: "鍏跺畠鍖 "
								}
							},
							511800: {
								title: "板呭畨宁 ",
								districts: {
									511802: "板ㄥ煄鍖 ",
									511821: "钖嶅北铡 ",
									511822: "钻ョ粡铡 ",
									511823: "姹夋簮铡  ",
									511824: "鐭虫铡 ",
									511825: "澶╁叏铡 ",
									511826: "鑺﹀北铡 ",
									511827: "瀹濆叴铡 ",
									511828: "鍏跺畠鍖  "
								}
							},
							511900: {
								title: "宸翠腑宁 ",
								districts: {
									511902: "宸村窞鍖 ",
									511921: "阃氭睙铡 ",
									511922: "鍗楁睙铡 ",
									511923: "骞虫枪铡 ",
									511924: "鍏跺畠鍖 "
								}
							},
							512000: {
								title: "璧勯槼宁 ",
								districts: {
									512002: "板佹睙鍖 ",
									512021: "瀹夊渤铡 ",
									512022: "涔愯呖铡 ",
									512081: "绠€阒冲竞",
									512082: "鍏跺畠鍖 "
								}
							},
							513200: {
								title: "阒垮潩钘忔棌缇屾棌镊不宸 ",
								districts: {
									513221: "姹跺窛铡 ",
									513222: "鐞嗗幕",
									513223: "锣效幕",
									513224: "鏉炬綐铡 ",
									513225: "涔濆娌熷幕",
									513226: "阅戝窛铡 ",
									513227: "灏忛噾铡 ",
									513228: "榛戞按铡 ",
									513229: "椹皵搴峰幕",
									513230: "澹ゅ铡 ",
									513231: "阒垮潩铡 ",
									513232: "鑻ュ皵鐩栧幕",
									513233: "绾㈠师铡 ",
									513234: "鍏跺畠鍖 "
								}
							},
							513300: {
								title: "鐢桦瓬钘忔棌镊不宸 ",
								districts: {
									513321: "搴峰畾铡 ",
									513322: "娉稿畾铡 ",
									513323: "涓瑰反铡 ",
									513324: "涔濋緳铡 ",
									513325: "板呮睙铡 ",
									513326: "阆揿瓪铡 ",
									513327: "镣夐湇铡 ",
									513328: "鐢桦瓬铡 ",
									513329: "鏂伴緳铡 ",
									513330: "寰锋牸铡 ",
									513331: "锏界帀铡 ",
									513332: "鐭虫笭铡 ",
									513333: "鑹茶揪铡 ",
									513334: "鐞嗗铡 ",
									513335: "宸村铡 ",
									513336: "涔″煄铡 ",
									513337: "绋诲煄铡 ",
									513338: "寰楄崳铡 ",
									513339: "鍏跺畠鍖 "
								}
							},
							513400: {
								title: "鍑夊北褰濇棌镊不宸 ",
								districts: {
									513401: "瑗挎枪宁 ",
									513422: "链ㄩ噷钘忔棌镊不铡 ",
									513423: "鐩愭簮铡 ",
									513424: "寰锋枪铡 ",
									513425: "浼氱悊铡  ",
									513426: "浼氢笢铡 ",
									513427: "瀹佸崡铡 ",
									513428: "鏅牸铡 ",
									513429: "宁冩袅铡 ",
									513430: "阅戦槼铡 ",
									513431: "鏄铡 ",
									513432: "锽滃痉铡 ",
									513433: "鍐曞畞铡 ",
									513434: "瓒婅タ铡 ",
									513435: "鐢樻礇铡 ",
									513436: "缇庡铡 ",
									513437: "板锋尝铡 ",
									513438: "鍏跺畠鍖 "
								}
							}
						}
					},
					520000: {
						title: "璐靛窞鐪 ",
						cities: {
							520100: {
								title: "璐甸槼宁 ",
								districts: {
									520102: "鍗楁槑鍖 ",
									520103: "浜戝博鍖 ",
									520111: "鑺辨邯鍖 ",
									520112: "涔屽綋鍖 ",
									520113: "锏戒簯鍖 ",
									520114: "灏忔渤鍖 ",
									520121: "寮€阒冲幕",
									520122: "鎭兘铡 ",
									520123: "淇枃铡 ",
									520151: "阅戦槼寮€鍙戝尯",
									520181: "娓呴晣宁 ",
									520182: "鍏跺畠鍖 "
								}
							},
							520200: {
								title: "鍏洏姘村竞",
								districts: {
									520201: "阍熷北鍖 ",
									520203: "鍏灊鐗瑰尯",
									520221: "姘村煄铡 ",
									520222: "鐩桦幕",
									520223: "鍏跺畠鍖 "
								}
							},
							520300: {
								title: "阆典箟宁 ",
								districts: {
									520302: "绾㈣姳宀楀尯",
									520303: "姹囧窛鍖 ",
									520321: "阆典箟铡 ",
									520322: "妗愭铡 ",
									520323: "缁ラ槼铡 ",
									520324: "姝ｅ畨铡 ",
									520325: "阆撶湡浠′浆镞忚嫍镞忚嚜娌诲幕",
									520326: "锷″窛浠′浆镞忚嫍镞忚嚜娌诲幕",
									520327: "鍑ゅ念铡 ",
									520328: "婀勬江铡 ",
									520329: "浣椤简铡 ",
									520330: "涔犳按铡 ",
									520381: "璧ゆ按宁 ",
									520382: "浠佹€€宁 ",
									520383: "鍏跺畠鍖 "
								}
							},
							520400: {
								title: "瀹夐『宁 ",
								districts: {
									520402: "瑗跨鍖 ",
									520421: "骞冲潩铡 ",
									520422: "鏅畾铡 ",
									520423: "闀囧畞宁冧緷镞忚嫍镞忚嚜娌诲幕",
									520424: "鍏冲箔宁冧緷镞忚嫍镞忚嚜娌诲幕",
									520425: "绱簯鑻楁棌宁冧緷镞忚嚜娌诲幕",
									520426: "鍏跺畠鍖 "
								}
							},
							522200: {
								title: "阈滀粊鍦板尯",
								districts: {
									522201: "阈滀粊宁 ",
									522222: "姹熷彛铡 ",
									522223: "鐜夊睆渚楁棌镊不铡 ",
									522224: "鐭抽椁铡 ",
									522225: "镐濆崡铡 ",
									522226: "鍗版睙鍦熷镞忚嫍镞忚嚜娌诲幕",
									522227: "寰锋睙铡 ",
									522228: "娌挎渤鍦熷镞忚嚜娌诲幕",
									522229: "鏉炬鑻楁棌镊不铡 ",
									522230: "涓囧北鐗瑰尯",
									522231: "鍏跺畠鍖  "
								}
							},
							522300: {
								title: "榛旇タ鍗楀竷渚濇棌鑻楁棌镊不宸 ",
								districts: {
									522301: "鍏翠箟宁 ",
									522322: "鍏翠粊铡  ",
									522323: "鏅畨铡 ",
									522324: "鏅撮殕铡 ",
									522325: "璐炰赴铡 ",
									522326: "链涜盁铡 ",
									522327: "鍐屼酣铡  ",
									522328: "瀹夐緳铡 ",
									522329: "鍏跺畠鍖 "
								}
							},
							522400: {
								title: "姣曡妭鍦板尯",
								districts: {
									522401: "姣曡妭宁 ",
									522422: "澶ф楠铡 ",
									522423: "榛旇タ铡 ",
									522424: "阅戞瞰铡 ",
									522425: "缁回噾铡 ",
									522426: "绾抽泹铡 ",
									522427: "濞佸畞褰濇棌锲炴棌鑻楁棌镊不铡 ",
									522428: "璧珷铡 ",
									522429: "鍏跺畠鍖 "
								}
							},
							522600: {
								title: "榛斾笢鍗楄嫍镞忎缑镞忚嚜娌诲窞",
								districts: {
									522601: "鍑噷宁 ",
									522622: "榛勫钩铡 ",
									522623: "鏂界铡 ",
									522624: "涓夌铡 ",
									522625: "闀囱翻铡 ",
									522626: "宀戝珐铡 ",
									522627: "澶╂煴铡 ",
									522628: "阌﹀睆铡 ",
									522629: "鍓戞渤铡 ",
									522630: "鍙版睙铡 ",
									522631: "榛庡钩铡 ",
									522632: "姒曟睙铡 ",
									522633: "浠庢睙铡 ",
									522634: "板峰北铡 ",
									522635: "楹绘睙铡 ",
									522636: "涓瑰铡 ",
									522637: "鍏跺畠鍖 "
								}
							},
							522700: {
								title: "榛斿崡宁冧緷镞忚嫍镞忚嚜娌诲窞",
								districts: {
									522701: "閮借寢宁 ",
									522702: "绂忔硥宁 ",
									522722: "钻旀尝铡 ",
									522723: "璐靛畾铡 ",
									522725: "鐡畨铡 ",
									522726: "镫北铡 ",
									522727: "骞冲铡 ",
									522728: "缃楃敻铡 ",
									522729: "闀块『铡 ",
									522730: "榫欓噷铡 ",
									522731: "鎯犳按铡 ",
									522732: "涓夐兘姘存棌镊不铡 ",
									522733: "鍏跺畠鍖 "
								}
							}
						}
					},
					