<?php
namespace enum;

class AdType extends Enum{
    public static $data = [
        1=>'首页轮播图(750*340)',
        2=>'圈子轮播图(750*340)',
     //   3=>'抢购轮播图(750*240)',
        4=>'商家轮播图(750*340)',
        5=>'普通商品轮播图(750*240)',
        9=>'首页中部广告图1(355*100)',
        10=>'首页中部广告图2(355*100)',
        11=>'预约商品轮播图(750*240)',

     //   6=>'拼团轮播图(750*240)',
     //   7=>'免单轮播图(750*240)',
        //广告位
    /*    20=>'首页普通商品推荐广告位(710*180)',
        21=>'首页抢购推荐广告位(710*180)',
        22=>'首页优惠券推荐广告位(710*180)',
        23=>'首页拼团推荐广告位(710*180)',
        24=>'首页免单活动推荐广告位(710*180)',*/
    ];
}