<?php
// +----------------------------------------------------------------------
// | msvodx[TP5内核]
// +----------------------------------------------------------------------
// | Copyright © 2019-QQ97250974
// +----------------------------------------------------------------------
// | 专业二开仿站定制修改,做最专业的视频点播系统
// +----------------------------------------------------------------------
// | Author: cherish ©2018
// +----------------------------------------------------------------------
namespace app\admin\model;

use think\Model;

/**
 * 后台菜单语言模型
 * @package app\admin\model
 */
class AdminMenuLang extends Model
{
    // 自动写入时间戳
    protected $autoWriteTimestamp = false;
}
